{"vocabs": {"type_tag": {"__OTHER__": 0, "7zip": 1, "android": 2, "apple": 3, "appledouble": 4, "appleplist": 5, "bat": 6, "bittorrent": 7, "bmp": 8, "bzip": 9, "c": 10, "cab": 11, "cap": 12, "coff": 13, "com": 14, "cpp": 15, "crt": 16, "crx": 17, "csv": 18, "deb": 19, "dmg": 20, "doc": 21, "docx": 22, "ebook": 23, "elf": 24, "email": 25, "emf": 26, "eot": 27, "flash": 28, "gif": 29, "gzip": 30, "html": 31, "ico": 32, "ini": 33, "isoimage": 34, "jar": 35, "java": 36, "java-bytecode": 37, "javascript": 38, "jpeg": 39, "json": 40, "lnk": 41, "m3u": 42, "mac": 43, "macho": 44, "mp4": 45, "mscompress": 46, "msi": 47, "mz": 48, "odt": 49, "outlook": 50, "pdf": 51, "pedll": 52, "peexe": 53, "pgp": 54, "php": 55, "png": 56, "powershell": 57, "ppt": 58, "pptx": 59, "ps": 60, "pyc": 61, "python": 62, "qt": 63, "rar": 64, "rpm": 65, "rtf": 66, "ruby": 67, "sgml": 68, "shell": 69, "sql": 70, "tar": 71, "targa": 72, "text": 73, "ttf": 74, "vba": 75, "whl": 76, "woff": 77, "xls": 78, "xlsx": 79, "xml": 80, "zip": 81, "zlib": 82}, "type_extension": {"__OTHER__": 0, "7zip": 1, "apk": 2, "bat": 3, "bmp": 4, "bom": 5, "bzip": 6, "c": 7, "cab": 8, "cap": 9, "class": 10, "com": 11, "cpp": 12, "crt": 13, "crx": 14, "csv": 15, "deb": 16, "dll": 17, "dmg": 18, "doc": 19, "docx": 20, "emf": 21, "eml": 22, "eot": 23, "epub": 24, "exe": 25, "gif": 26, "gzip": 27, "html": 28, "ico": 29, "ini": 30, "iso": 31, "jar": 32, "java": 33, "jpg": 34, "js": 35, "json": 36, "lnk": 37, "m3u": 38, "mobi": 39, "mp4": 40, "msg": 41, "msi": 42, "o": 43, "odt": 44, "pdf": 45, "php": 46, "plist": 47, "png": 48, "ppt": 49, "pptx": 50, "ps": 51, "ps1": 52, "py": 53, "pyc": 54, "qt": 55, "rar": 56, "rb": 57, "rpm": 58, "rtf": 59, "sgml": 60, "sh": 61, "so": 62, "sql": 63, "swf": 64, "tar": 65, "tga": 66, "torrent": 67, "ttf": 68, "txt": 69, "vbs": 70, "whl": 71, "woff": 72, "xls": 73, "xlsx": 74, "xml": 75, "zip": 76, "zlib": 77}, "registrar": {"__OTHER__": 0, "1&1 INTERNET SE": 1, "1&1 IONOS SE": 2, "101domain GRS Limited": 3, "123-Reg Limited": 4, "1API GmbH": 5, "22net, Inc.": 6, "ACTIVE-RU": 7, "AKKY ONLINE SOLUTIONS, S.A. DE C.V.": 8, "ALIBABA.COM SINGAPORE E-COMMERCE PRIVATE LIMITED": 9, "ARDIS-RU": 10, "ASCIO TECHNOLOGIES INC": 11, "AXELNAME-RU": 12, "Aceville Pte. Ltd.": 13, "Alibaba Cloud Computing (Beijing) Co., Ltd.": 14, "Alibaba Cloud Computing Ltd. d/b/a HiChina (www.net.cn)": 15, "All Domains LLC": 16, "Amazon Registrar, Inc.": 17, "Annulet LLC": 18, "Ascio Technologies, Inc": 19, "Ascio Technologies, Inc.": 20, "Ascio Technologies, Inc. Danmark - Filial af Ascio technologies, Inc. USA": 21, "Automattic Inc.": 22, "BEGET-RU": 23, "BEIJING INNOVATIVE LINKAGE TECHNOLOGY LTD. DBA DNS.COM.CN": 24, "Bizcn.com, Inc.": 25, "Bluehost Inc.": 26, "CAP CONNECT": 27, "CCI REG S.A.": 28, "CENTRALNIC CANADA INC": 29, "CITRA": 30, "CJSC REGISTRAR R01": 31, "CSC CORPORATE DOMAINS, INC.": 32, "CSC Corporate Domains": 33, "CSC Corporate Domains, Inc.": 34, "CSL Computer Service Langenbach GmbH d/b/a joker.com": 35, "CV. Jogjacamp": 36, "Center of Ukrainian Internet Names (UKRNAMES)": 37, "CloudFlare, Inc.": 38, "Cloudflare, Inc": 39, "Cloudflare, Inc.": 40, "CommuniGal Communication Ltd.": 41, "Communigal Communications Ltd": 42, "ConnectWave co.,Ltd": 43, "Cosmotown, Inc.": 44, "DANESCO TRADING LTD": 45, "DNC Holdings, Inc": 46, "DNSPod, Inc.": 47, "DOMAINPEOPLE, INC.": 48, "DOMAINSHOP-RU": 49, "DREAMHOST": 50, "DYNADOT LLC": 51, "DYNADOT, LLC": 52, "Danesco Trading Ltd.": 53, "Domain Original, LLC": 54, "Domain.com - Network Solutions, LLC": 55, "Domain.com, LLC": 56, "DomainContext, Inc.": 57, "DomainPeople, Inc.": 58, "Dominet (HK) Limited": 59, "Dotname Korea Corp.": 60, "Dreamscape Networks International Pte Ltd": 61, "DropCatch.com 1225 LLC": 62, "DropCatch.com 1322 LLC": 63, "DropCatch.com 684 LLC": 64, "DropCatch.com 736 LLC": 65, "Dynadot Inc": 66, "Dynadot LLC": 67, "Dynadot, LLC": 68, "Dynu Systems Incorporated": 69, "ENOM, INC.": 70, "ERANET INTERNATIONAL LIMITED": 71, "EVOPLUS LTD": 72, "EnCirca, Inc.": 73, "Endurance Domains Technology LLP": 74, "EuroDNS S.A.": 75, "Exabytes Network Sdn Bhd": 76, "Fast Domain Inc.": 77, "FastDomain Inc.": 78, "FindYouAName.com LLC": 79, "Free Drop Zone LLC": 80, "Free Spirit Domains, LLC": 81, "Freshbreweddomains.com LLC": 82, "GANDI SAS": 83, "GMO": 84, "GMO INTERNET, INC.": 85, "GMO INTERNET, INC. DBA ONAMAE.COM": 86, "GMO Internet Group, Inc. d/b/a Onamae.com": 87, "GMO Internet, Inc.": 88, "GMO Internet, Inc. d/b/a Onamae.com": 89, "GODADDY.COM, LLC": 90, "GRAN-0063CZ": 91, "GRANSY S.R.O D/B/A SUBREG.CZ": 92, "GRANSY s.r.o.": 93, "Gabia, Inc.": 94, "Gandi SAS": 95, "Global Domain Group LLC": 96, "Gname.com Pte. Ltd.": 97, "Go Daddy Domains Canada, Inc": 98, "Go Daddy, LLC": 99, "GoDaddy": 100, "GoDaddy Corporate Domains, LLC": 101, "GoDaddy Online Services Cayman Islands Ltd.": 102, "GoDaddy.com, Inc.": 103, "GoDaddy.com, LLC": 104, "Google Inc.": 105, "Google LLC": 106, "Google LLC.": 107, "Government of Kingdom of Tonga": 108, "HANGANG SYSTEMS,INC. D/B/A DOREGI.COM": 109, "HOSTING CONCEPTS B.V.": 110, "HOSTINGER operations, UAB": 111, "Hadara Technology": 112, "Hello Internet Corp": 113, "Hetzner Online GmbH ( https://nic.at/registrar/225 )": 114, "Hong Kong Juming Network Technology Co., Ltd.": 115, "Hosting Concepts B.V. d/b/a Openprovider": 116, "Hosting Concepts B.V. d/b/a Registrar.eu": 117, "Hostinger, UAB": 118, "INAMES CO., LTD.": 119, "INWX GmbH": 120, "IONOS SE": 121, "ITEASY Inc.": 122, "Infomaniak Network SA": 123, "InterNetX GmbH": 124, "Internet Domain Service BS Corp": 125, "Internet Invest, Ltd. dba Imena.ua": 126, "Japan Registry Services Co., Ltd.": 127, "KEY-SYSTEMS GMBH": 128, "Key Systems GmbH": 129, "Key-Systems GmbH": 130, "Launchpad.com Inc.": 131, "Letshost/ Team Blue Internet Services IE Ltd": 132, "Lexsynergy Limited": 133, "Libyan Spider Network (int)": 134, "Longming Pte. Ltd.": 135, "Loopia AB": 136, "MarkMonitor Inc.": 137, "MarkMonitor Information Technology (Shanghai) Co., Ltd.": 138, "MarkMonitor, Inc (TLDs)": 139, "MarkMonitor, Inc.": 140, "Media Elite Holdings Limited": 141, "Megazone Corp., dba HOSTING.KR": 142, "Mesh Digital Limited": 143, "Metaregistrar BV": 144, "Mvpdomainnames.com LLC": 145, "Mypreciousdomain.com LLC": 146, "NAMECHEAP": 147, "NAMECHEAP INC": 148, "NAMESILO, LLC": 149, "NIC-REG1": 150, "NICENIC INTERNATIONAL GROUP CO., LIMITED": 151, "NOM-IQ Ltd dba Com Laude": 152, "NORDNET": 153, "Name SRS AB": 154, "Name.com, Inc.": 155, "NameCheap Inc.": 156, "NameCheap, Inc": 157, "NameCheap, Inc.": 158, "NamePal.com #8024 Inc.": 159, "NamePal.com #8024, LLC": 160, "NameSilo": 161, "NameSilo, LLC": 162, "NameSilo,LLC": 163, "Namecheap": 164, "Namecheap Inc.": 165, "Namesilo, LLC": 166, "Namespro Solutions Inc.": 167, "NetEarth One Inc. d/b/a NetEarth": 168, "Netdorm, Inc. dba DNSExit.com": 169, "Network Solutions, LLC": 170, "Network Solutions, LLC.": 171, "Noteworthydomains, LLC": 172, "ONLINENIC, INC.": 173, "OPENPROV-RU": 174, "OVH": 175, "OVH sas": 176, "OnlineNIC, Inc.": 177, "OnlineNIC, Inc. d/b/a China-channel.com": 178, "OpenTLD B.V.": 179, "OregonEU.com LLC": 180, "OwnRegistrar, Inc.": 181, "P.A. Viet Nam Company Limited": 182, "PDR LTD. D/B/A PUBLICDOMAINREGISTRY.COM": 183, "PDR Ltd": 184, "PDR Ltd. d/b/a PublicDomainRegistry.com": 185, "Porkbun": 186, "Porkbun LLC": 187, "R01-RF": 188, "R01-RU": 189, "REALTIME REGISTER B.V.": 190, "REALTIME REGISTER BV": 191, "REBEL.COM CORP.": 192, "REG-INTERNET-CZ": 193, "REG-MEDIA4WEB": 194, "REGISTER S.P.A.": 195, "REGISTER.COM, INC.": 196, "REGISTRAR OF DOMAIN NAMES REG.RU LLC": 197, "REGRU-RF": 198, "REGRU-RU": 199, "REGTIME-RU": 200, "RU-CENTER-RU": 201, "RUCENTER-RF": 202, "Rally Cry Domains, LLC": 203, "RealTime Register BV": 204, "Reg2C.com Inc.": 205, "Regional Network Information Center, JSC dba RU-CENTER": 206, "Register Domain SA": 207, "Register.com - Network Solutions, LLC": 208, "Register.com, Inc.": 209, "Registrar of Domain Names REG.RU LLC": 210, "Registrar of Domain Names REG.RU, LLC": 211, "RegistrarSEC LLC": 212, "RegistryGate GmbH": 213, "Romarg SRL": 214, "SAV.COM, LLC": 215, "SCALEWAY": 216, "SHANGHAI MEICHENG TECHNOLOGY INFORMATION DEVELOPMENT CO., LTD.": 217, "SNAPNAMES 29, LLC": 218, "SNAPNAMES 38, LLC": 219, "SNAPNAMES 45, LLC": 220, "SNAPNAMES 47, INC.": 221, "SNAPNAMES 53, LLC": 222, "SNAPNAMES 60, LLC": 223, "SPRINTNAMES-RU": 224, "STORK REGISTRY INC.": 225, "SafeNames Ltd.": 226, "Samjung Data Service Co., Ltd": 227, "Sarek Oy": 228, "Scaleway SAS": 229, "Sharkweek Domains LLC": 230, "Shinjiru Technology Sdn Bhd": 231, "Slow Motion Domains LLC": 232, "Soaring Eagle Domains, LLC": 233, "Spaceship, Inc.": 234, "Squarespace Domains II LLC": 235, "Squarespace Domains LLC": 236, "Stichting Registrar of Last Resort Foundation": 237, "THNIC": 238, "TIMEWEB-RF": 239, "TIMEWEB-RU": 240, "TLD Registrar Solutions Ltd": 241, "TLD Registrar Solutions Ltd.": 242, "TUCOWS DOMAINS, INC.": 243, "TUCOWS, INC.": 244, "TUCOWS.COM, CO.": 245, "The Registrar Company B.V.": 246, "Threepoint Domains LLC": 247, "Travel Domains, LLC": 248, "Tucows Domains Inc.": 249, "Tucows.com Co.": 250, "TurnCommerce, Inc. DBA NameBright.com": 251, "Udamain.com LLC": 252, "VIAWEB Inc.": 253, "Vautron Rechenzentrum AG": 254, "Vitalwerks Internet Solutions, LLC / No-IP.com": 255, "Vitalwerks Internet Solutions, LLC DBA No-IP": 256, "WEBCC": 257, "WHC Online Solutions Inc.": 258, "Web Commerce Communications (S) Pte Ltd": 259, "Web4Africa (Pty) Ltd": 260, "West263 International Limited": 261, "Whois Corp.": 262, "Wild Bunch Domains, LLC": 263, "Wild West Domains, LLC": 264, "Xin Net Technology Corporation": 265, "co.ukrnames": 266, "eNom, Inc.": 267, "eNom, LLC": 268, "easyDNS Technologies Inc.": 269, "get.gov": 270, "nicar": 271, "ua.101domain": 272, "ua.hostpro": 273, "ua.imena": 274, "ua.nic": 275, "ua.sitevalley": 276, "ua.tanhost": 277, "ua.ukrnames": 278, "ua.webcraft-llc": 279, "ua.x-host": 280}, "tld": {"__OTHER__": 0, "ac.id": 1, "ac.kr": 2, "ac.th": 3, "academy": 4, "ae": 5, "ag": 6, "ai": 7, "app": 8, "art": 9, "at": 10, "ba.gov.br": 11, "bazar": 12, "be": 13, "best": 14, "bid": 15, "biz": 16, "business": 17, "buzz": 18, "ca": 19, "cab": 20, "casa": 21, "cash": 22, "cc": 23, "cf": 24, "cfd": 25, "ch": 26, "ci": 27, "cl": 28, "click": 29, "cloud": 30, "club": 31, "cn": 32, "co": 33, "co.cr": 34, "co.id": 35, "co.il": 36, "co.in": 37, "co.jp": 38, "co.kr": 39, "co.th": 40, "co.uk": 41, "co.za": 42, "com": 43, "com.ar": 44, "com.au": 45, "com.br": 46, "com.cn": 47, "com.co": 48, "com.my": 49, "com.ng": 50, "com.pk": 51, "com.sa": 52, "com.sg": 53, "com.tr": 54, "com.ua": 55, "coop": 56, "cyou": 57, "cz": 58, "de": 59, "dev": 60, "digital": 61, "direct": 62, "dk": 63, "doctor": 64, "download": 65, "edu.cn": 66, "email": 67, "es": 68, "eu": 69, "finance": 70, "fm": 71, "fr": 72, "fun": 73, "ga": 74, "gd": 75, "gdn": 76, "gob.mx": 77, "goog": 78, "gov": 79, "gov.ae": 80, "gov.kw": 81, "gov.ph": 82, "gq": 83, "gr": 84, "guru": 85, "hk": 86, "host": 87, "hu": 88, "icu": 89, "id": 90, "ie": 91, "im": 92, "in": 93, "in-addr.arpa": 94, "in.ua": 95, "info": 96, "investments": 97, "io": 98, "ip6.arpa": 99, "ir": 100, "is": 101, "it": 102, "jp": 103, "kiev.ua": 104, "kr": 105, "la": 106, "lat": 107, "life": 108, "link": 109, "live": 110, "lk": 111, "lol": 112, "ltd": 113, "lu": 114, "ly": 115, "ma": 116, "me": 117, "men": 118, "microsoft": 119, "mil": 120, "ml": 121, "mobi": 122, "monster": 123, "ms": 124, "my.id": 125, "name": 126, "ne.jp": 127, "net": 128, "net.au": 129, "net.ua": 130, "network": 131, "ng": 132, "ngo": 133, "nl": 134, "one": 135, "online": 136, "or.kr": 137, "org": 138, "org.uk": 139, "page": 140, "ph": 141, "photography": 142, "pics": 143, "pk": 144, "pl": 145, "place": 146, "pm": 147, "pro": 148, "ps": 149, "pw": 150, "reviews": 151, "ro": 152, "rocks": 153, "ru": 154, "run": 155, "sbs": 156, "science": 157, "se": 158, "services": 159, "sg": 160, "shop": 161, "site": 162, "sk": 163, "skin": 164, "space": 165, "store": 166, "stream": 167, "su": 168, "support": 169, "surf": 170, "sx": 171, "systems": 172, "team": 173, "tech": 174, "tj": 175, "tk": 176, "to": 177, "top": 178, "trade": 179, "tv": 180, "tw": 181, "ua": 182, "uk": 183, "uno": 184, "us": 185, "vin": 186, "vip": 187, "vn": 188, "wang": 189, "watch": 190, "web.tr": 191, "website": 192, "win": 193, "work": 194, "world": 195, "ws": 196, "xn--p1ai": 197, "xyz": 198}, "country": {"__OTHER__": 0, "AE": 1, "AL": 2, "AR": 3, "AT": 4, "AU": 5, "BD": 6, "BE": 7, "BG": 8, "BR": 9, "CA": 10, "CH": 11, "CL": 12, "CN": 13, "CO": 14, "CR": 15, "CY": 16, "CZ": 17, "DE": 18, "DK": 19, "DO": 20, "EE": 21, "ES": 22, "FI": 23, "FR": 24, "GB": 25, "GR": 26, "HK": 27, "HR": 28, "HU": 29, "ID": 30, "IE": 31, "IL": 32, "IN": 33, "IQ": 34, "IR": 35, "IS": 36, "IT": 37, "JE": 38, "JP": 39, "KR": 40, "KW": 41, "KZ": 42, "LB": 43, "LT": 44, "LU": 45, "LV": 46, "MC": 47, "MD": 48, "MX": 49, "MY": 50, "NL": 51, "NO": 52, "NZ": 53, "OM": 54, "PE": 55, "PK": 56, "PL": 57, "PS": 58, "PT": 59, "RO": 60, "RU": 61, "SA": 62, "SC": 63, "SE": 64, "SG": 65, "SK": 66, "SY": 67, "TH": 68, "TJ": 69, "TR": 70, "TW": 71, "UA": 72, "US": 73, "UZ": 74, "VG": 75, "VN": 76, "ZA": 77}, "continent": {"__OTHER__": 0, "AF": 1, "AS": 2, "EU": 3, "NA": 4, "OC": 5, "SA": 6}, "as_owner": {"__OTHER__": 0, "10dencehispahard, S.L.": 1, "123.Net, Inc.": 2, "23M GmbH": 3, "23VNet Kft.": 4, "A2 Hosting, Inc.": 5, "AFRIHOST-SP": 6, "ALFA TELECOM s.r.o.": 7, "ARTERIA Networks Corporation": 8, "ASLINE LIMITED": 9, "AT&T Enterprises, LLC": 10, "Access2.IT Group B.V.": 11, "Ace Host, LLC": 12, "Adobe Inc.": 13, "Advania Island ehf": 14, "Afranet": 15, "Aiyun HK Network": 16, "Akamai Connected Cloud": 17, "Akamai International B.V.": 18, "Akamai Technologies, Inc.": 19, "Alibaba US Technology Co., Ltd.": 20, "Allstream Business US, LLC": 21, "Amazon.com, Inc.": 22, "Apple Inc.": 23, "Aptum Technologies": 24, "Arelion Sweden AB": 25, "Aruba S.p.A.": 26, "Asiatech Data Transmission company": 27, "Atria Convergence Technologies Pvt. Ltd. Broadband Internet Service Provider INDIA": 28, "Automattic, Inc": 29, "Avatel Telecom, SA": 30, "Awaser Oman LLC": 31, "Axera SpA": 32, "BELNET": 33, "BENCHMARK INTERNET GROUP": 34, "BL Networks": 35, "BROADBANDIDC": 36, "Batterflyai Media ltd.": 37, "Beget LLC": 38, "Belcloud LTD": 39, "Bradler & Krantz GmbH & Co. KG": 40, "CDNetworks": 41, "CHINA UNICOM China169 Backbone": 42, "CHINANET Guangdong province network": 43, "CHINANET SHAANXI province Cloud Base network": 44, "CHINATELECOM JiangSu YangZhou IDC networkdescr: YangZhouJiangsu Province, P.R.China.": 45, "CHINATELECOM Jiangsu province Changzhou 5G network": 46, "CNSERVERS LLC": 47, "CT-HangZhou-IDC": 48, "CTG Server Limited": 49, "CW Vodafone Group PLC": 50, "Canonical Group Limited": 51, "Celeste SAS": 52, "Centrilogic, Inc.": 53, "CenturyLink Communications, LLC": 54, "Charter Communications Inc": 55, "China Education and Research Network Center": 56, "China Networks Inter-Exchange": 57, "China Telecom": 58, "China Telecom Group": 59, "China Unicom Beijing Province Network": 60, "China Unicom Guangdong IP network": 61, "Chinanet": 62, "Cisco OpenDNS, LLC": 63, "Cjsc Rascom": 64, "Claranet Limited": 65, "Claranet SAS": 66, "Cloudflare London, LLC": 67, "Cloudflare, Inc.": 68, "Cogent Communications, LLC": 69, "ColoUp": 70, "Comcast Cable Communications, LLC": 71, "Confluence Networks Inc": 72, "Contabo GmbH": 73, "Core-Backbone GmbH": 74, "CtrlS": 75, "Cyber Wurx LLC": 76, "CyberCloud Professionals LLC": 77, "DAOU TECHNOLOGY": 78, "DFW Datacenter": 79, "DXTL Tseung Kwan O Service": 80, "Dade Pardazi Mobinhost Co LTD": 81, "Data Communication Business Group": 82, "DataMesh Networks Limited": 83, "DataWagon LLC": 84, "DataWeb Global Group B.V.": 85, "Datacamp Limited": 86, "Deutsche Glasfaser Wholesale GmbH": 87, "Deutsche Telekom AG": 88, "Deutsche Welle Anstalt des Oeffentlichen Rechts": 89, "Digicom SHPK": 90, "DigitalOcean, LLC": 91, "Domain names registrar REG.RU, Ltd": 92, "Dropbox, Inc.": 93, "Droptop GmbH": 94, "ECIT Solutions A/S": 95, "EGIHosting": 96, "ESET, spol. s r.o.": 97, "Edgecast Inc.": 98, "Edgenext Legend Dynasty Pte. Ltd.": 99, "Elite Limited": 100, "ElmoNet Oy": 101, "Emirates Telecommunications Group Company (etisalat Group) Pjsc": 102, "Endeavor Communications": 103, "Enzu Inc": 104, "Eonix Corporation": 105, "EstNOC OU": 106, "EuroByte LLC": 107, "Eurofiber Cloud Infra B.V.": 108, "FDCservers.net": 109, "Facebook, Inc.": 110, "Fanavari Serverpars Argham Gostar Company Ltd.": 111, "Fastly, Inc.": 112, "Flyservers S.A.": 113, "Forewin Telecom Group Limited, ISP at": 114, "FranTech Solutions": 115, "Free SAS": 116, "Freethought Internet Limited": 117, "Fundaments B.V.": 118, "Fuzhou": 119, "GANDI SAS": 120, "GLASFASER RUHR GmbH & Co. KG": 121, "GMO Internet Group, Inc.": 122, "GNET INC.": 123, "GTHost": 124, "GTT Communications Inc.": 125, "Gigabit Hosting Sdn Bhd": 126, "GitHub, Inc.": 127, "Glesys AB": 128, "Global Connectivity Solutions Llp": 129, "Global Layer B.V.": 130, "GoDaddy.com, LLC": 131, "Google LLC": 132, "GorillaServers, Inc.": 133, "Gransy s.r.o.": 134, "Green Floid LLC": 135, "Guizhou GuiAn IDC": 136, "Gwy It Pty Ltd": 137, "HIVELOCITY, Inc.": 138, "HT": 139, "HZ Hosting Ltd": 140, "Hangzhou Alibaba Advertising Co.,Ltd.": 141, "Heart Internet limited": 142, "Hengyang": 143, "Hetzner Online GmbH": 144, "Hivelocity LLC": 145, "Host Europe GmbH": 146, "Host Sailor Ltd": 147, "HostDime.com, Inc.": 148, "HostPapa": 149, "HostRoyale Technologies Pvt Ltd": 150, "HostUS": 151, "Hosteur SAS": 152, "Hosting Solution Ltd.": 153, "Hosting Ukraine LTD": 154, "Hosting technology LTD": 155, "Hostinger International Limited": 156, "Hostkey B.v.": 157, "Hostopia Australia Web Pty Ltd": 158, "Hostway IDC": 159, "Hrvatska narodna banka": 160, "Hrvatski Telekom d.d.": 161, "Hurricane Electric LLC": 162, "Hydra Communications Ltd": 163, "I-servers Ltd": 164, "IBM Cloud": 165, "ICDSoft Ltd.": 166, "IONOS SE": 167, "IP-Projects GmbH & Co. KG": 168, "Immedion, LLC": 169, "InMotion Hosting, Inc.": 170, "Incapsula Inc": 171, "Infium, UAB": 172, "Informacines sistemos ir technologijos, UAB": 173, "InterStar Network Services, Inc.": 174, "Interkvm Host Srl": 175, "Internap Holding LLC": 176, "International Civil Aviation Organization": 177, "Internet Invest, Ltd.": 178, "Internet Magnate (Pty) Ltd": 179, "Interserver, Inc": 180, "Iomart Cloud Services Limited": 181, "Iomart Managed Services Limited": 182, "Ip Server LLC": 183, "Iraqcell Communications Co. Ltd.": 184, "Iron Hosting Centre LTD": 185, "Iron Mountain Data Center": 186, "JINHUA, ZHEJIANG Province, P.R.China.": 187, "JSC IOT": 188, "JSC Mediasoft ekspert": 189, "JSC RTComm.RU": 190, "JSC RetnNet": 191, "JSC Selectel": 192, "JTGlobal": 193, "Jisc Services Limited": 194, "Jsc ru-center": 195, "Jsc timeweb": 196, "Jumper GmbH": 197, "KDDI CORPORATION": 198, "KINX": 199, "Kakao Corp": 200, "Kamatera Inc": 201, "Kamatera, Inc.": 202, "Kaspersky Lab AO": 203, "Kaspersky Lab Switzerland GmbH": 204, "Kevin Holly": 205, "Korea Data Telecommunication Co., Ltd.": 206, "Korea Telecom": 207, "Krypt Technologies": 208, "LARUS Limited": 209, "LEASEWEB HONG KONG LIMITED": 210, "LEASEWEB SINGAPORE PTE. LTD.": 211, "LG DACOM Corporation": 212, "LLC Babilon-T": 213, "LLC T1Cloud": 214, "LLC VK": 215, "LLC astra Cloud": 216, "LUOGELANG FRANCE LIMITED": 217, "LY Corporation": 218, "Latisys-Denver, LLC": 219, "LeaseWeb Netherlands B.V.": 220, "Leaseweb Deutschland GmbH": 221, "Leaseweb USA, Inc.": 222, "Lebanese Armed Forces": 223, "Level 3 Parent, LLC": 224, "Libra S.r.l.": 225, "Limestone Networks, Inc.": 226, "Liquid Web, L.L.C": 227, "Loopia AB": 228, "M247 Europe SRL": 229, "MDlink online service center GmbH": 230, "MOD Mission Critical, LLC": 231, "MVPS LTD": 232, "Massachusetts Institute of Technology": 233, "Media Land LLC": 234, "Melbikomas UAB": 235, "Meteverse Limited.": 236, "Microsoft Corporation": 237, "Miss Hosting AB": 238, "MivoCloud SRL": 239, "NForce Entertainment B.V.": 240, "NTT America, Inc.": 241, "NTT DOCOMO BUSINESS,Inc.": 242, "Namecheap, Inc.": 243, "National Internet Backbone": 244, "Nayatel Pvt Ltd": 245, "Nazhin Sepahan IT and data processing plc": 246, "Nebula Global LLC": 247, "Negah Roshan Pars Company (PJS)": 248, "NetActuate, Inc": 249, "NetEase Building No.16 Ke Yun Road": 250, "NetLab Global": 251, "Netnod AB": 252, "Netsite A/S": 253, "Network Solutions, LLC": 254, "New Dream Network, LLC": 255, "NewMedia Express Pte Ltd": 256, "Newfold Digital, Inc.": 257, "Nexeon Technologies, Inc.": 258, "Next Layer Telekommunikationsdienstleistungs- und Beratungs GmbH": 259, "Nexthop AS": 260, "No.293,Wanbao Avenue": 261, "Nocix, LLC": 262, "Node4 Limited": 263, "Noyan Abr Arvan Co. ( Private Joint Stock)": 264, "Ntirety, Inc.": 265, "Nucleo de Inf. e Coord. do Ponto BR - NIC.": 266, "O2 Czech Republic, a.s.": 267, "OVH SAS": 268, "One.com A/S": 269, "Ops One AG": 270, "Oracle Corporation": 271, "Orange": 272, "Orange Business Digital Norway AS": 273, "Oy Crea Nova Hosting Solution Ltd": 274, "PE Skurykhin Mukola Volodumurovuch": 275, "PEG TECH INC": 276, "POWER LINE DATACENTER": 277, "PacketHub S.A.": 278, "Palestine Telecommunications Company (PALTEL)": 279, "Paradise Networks LLC": 280, "Pars Shabakeh Azarakhsh LLC": 281, "Partner Communications Ltd.": 282, "Pavel Jochim": 283, "Performive LLC": 284, "Petersburg Internet Network ltd.": 285, "Private Layer INC": 286, "PrivateSystems Networks": 287, "Proximus NV": 288, "PubMatic, Inc.": 289, "QuestNet GmbH": 290, "QuickPacket, LLC": 291, "Qwilt Inc.": 292, "RJK Multimedia Shop S. L . U.": 293, "Rackspace Hosting": 294, "Rackspace Ltd.": 295, "Red Hat, Inc.": 296, "Register S.p.A.": 297, "ReliableSite.Net LLC": 298, "Reliance Jio Infocomm Limited": 299, "Respina Networks & Beyond PJSC": 300, "Retelit Digital Services S.p.A.": 301, "RouterHosting LLC": 302, "SAKURA Internet Inc.": 303, "SECURED SERVERS LLC": 304, "SEDO GmbH": 305, "SEJONG NETWORKS": 306, "SK Broadband Co Ltd": 307, "SONICO COMUNICACIONES SRL": 308, "SWITCH, LTD": 309, "Sahdsoft-AS": 310, "Scalaxy B.V.": 311, "Scaleway S.a.s.": 312, "Scaleway SAS": 313, "Seflow s.r.l.": 314, "Serverius Holding B.V.": 315, "Servers Tech Fzco": 316, "Shabakah Net": 317, "Sharktech": 318, "Shenzhen Tencent Computer Systems Company Limited": 319, "Shinjiru Technology Sdn Bhd": 320, "Sia Nano IT": 321, "Signet B.V.": 322, "Single Mode Networks Ltd": 323, "Software Engineering Institute": 324, "Solar Communications GmbH": 325, "Southwest Cyberport, Inc.": 326, "Sprinthost.ru LLC": 327, "Squarespace, Inc.": 328, "Starry Network Limited": 329, "Steadfast": 330, "Stichting DIGI NL": 331, "Sucuri": 332, "Suike Information Technology SiChuan Co., Ltd": 333, "Syrian Telecommunication Private Closed Joint Stock Company": 334, "T3 Communications, Inc.": 335, "TATA COMMUNICATIONS AMERICA INC": 336, "TELECABLE DOMINICANO, S.A.": 337, "TELECOM ITALIA SPARKLE S.p.A.": 338, "TM TECHNOLOGY SERVICES SDN. BHD.": 339, "TURKTICARET.NET YAZILIM HIZMETLERI SAN. ve TIC. A.S.": 340, "Taiwan Academic Network TANet Information Center": 341, "Team Internet AG": 342, "Teknotel Telekomunikasyon Sanayi Ve Ticaret A.s.": 343, "Telappliant Limited": 344, "Tele Asia Limited": 345, "Telegram Messenger Inc": 346, "Telehouse EAD": 347, "Telmex Colombia S.A.": 348, "Telx": 349, "Tenable, Inc.": 350, "Tencent Building, Kejizhongyi Avenue": 351, "TeraSwitch Networks Inc.": 352, "Terrakom d.o.o.": 353, "The Constant Company, LLC": 354, "The Infrastructure Group B.V.": 355, "TheHost LLC": 356, "Thg Hosting Limited": 357, "Tier.Net Technologies LLC": 358, "TierPoint, LLC": 359, "Ting Fiber Inc.": 360, "Tipzor Media Srl": 361, "Trellian Pty. Limited": 362, "Tucows.com Co.": 363, "Twitter Inc.": 364, "UAB Cherry Servers": 365, "UK Dedicated Servers Limited": 366, "UNIT A17,9F SILVERCORP INTL TOWER 707-713 NATHAN RD": 367, "Ultahost, Inc.": 368, "Unified Layer": 369, "Unitas Global": 370, "United States Department of Defense DoD": 371, "Uteam LTD": 372, "Verizon Business": 373, "Vianova S.p.A": 374, "Vodafone GmbH": 375, "Voxility LLP": 376, "WHG Hosting Services Ltd": 377, "WIIT AG": 378, "WNET TELECOM USA Corp.": 379, "WebNX, Inc.": 380, "WebSupport s.r.o.": 381, "Webair Internet Development Company Inc.": 382, "West263 International Limited": 383, "WholeSale Internet, Inc.": 384, "Wix.com Ltd.": 385, "WoodyNet, Inc.": 386, "WorkTitans B.V.": 387, "WorldStream B.V.": 388, "XRUI TECHNOLOGY LIMITED": 389, "Xt Global Networks Ltd.": 390, "YANDEX LLC": 391, "Yahoo Holdings Inc.": 392, "Yahoo Japan": 393, "Yahoo-UK Limited": 394, "Yancy Limited": 395, "Yandex.Cloud LLC": 396, "Your Hosting B.V.": 397, "Yoursafe Holding B.V.": 398, "Zantan GmbH": 399, "Zappie Host LLC": 400, "Zayo Bandwidth": 401, "Zemlyaniy Dmitro Leonidovich": 402, "Zenlayer Inc": 403, "Zetta Hosting Solutions LLC.": 404, "Zillion Network Inc.": 405, "atom86 BV": 406, "aurologic GmbH": 407, "eNET Inc.": 408, "eSited Solutions": 409, "integration.net GmbH": 410, "netcup GmbH": 411, "punkt.de GmbH": 412, "servinga GmbH": 413, "shanghai science and technology network communication limited company": 414, "velia.net": 415, "velia.net Internetdienste GmbH": 416}, "rir": {"__OTHER__": 0, "AFRINIC": 1, "APNIC": 2, "ARIN": 3, "LACNIC": 4, "RIPE NCC": 5}, "threat_label": {"__OTHER__": 0, "aclpwn/htool": 1, "adware.": 2, "adware.airpush/andr": 3, "adware.dianle/andr": 4, "adware.dianle/dowgin": 5, "adware.domaiq/msil": 6, "adware.dowgin/addisplay": 7, "adware.dowgin/andr": 8, "adware.dowgin/dianle": 9, "adware.feiad/dowgin": 10, "adware.feiad/kuguo": 11, "adware.fusioncore/bundler": 12, "adware.hiddad/notifyer": 13, "adware.installcore/dealply": 14, "adware.jedan/dowgin": 15, "adware.kraddare/openshopper": 16, "adware.kuguo/addisplay": 17, "adware.kuguo/andr": 18, "adware.kyview/andr": 19, "adware.notifyer": 20, "adware.notifyer/fors": 21, "adware.notifyer/hiddad": 22, "adware.offercore/softonic": 23, "adware.opencandy": 24, "adware.openshopper/adkor": 25, "adware.openshopper/kraddare": 26, "adware.perion/perinet": 27, "adware.perion/searchprotect": 28, "adware.perion/webtoolbar": 29, "adware.raonmedia/kraddare": 30, "adware.searchprotect/clientconnect": 31, "adware.webcompanion/msil": 32, "adware.youmi/andr": 33, "alawar": 34, "alien": 35, "amos": 36, "andr/fgtl": 37, "andr/xgen": 38, "autoit/startpage": 39, "beryllium": 40, "bleah": 41, "boogr": 42, "cidox": 43, "connectwise/remotetool": 44, "crawler": 45, "decode": 46, "downloader.": 47, "downloader.argo1/mlvba": 48, "downloader.corona/macros": 49, "downloader.dwnlodr/shell": 50, "downloader.emodldr/powershell": 51, "downloader.emodldr/w97m": 52, "downloader.emooodldr/docdl": 53, "downloader.emooodldr/w97m": 54, "downloader.hancitor/heur2": 55, "downloader.heur2/w97m": 56, "downloader.logan/w97m": 57, "downloader.maldublnk": 58, "downloader.medusa/shell": 59, "downloader.python": 60, "downloader.shell/bash": 61, "downloader.w97m": 62, "downloader.w97m/docdrp": 63, "downloader.w97m/emodldr": 64, "downloader.w97m/emotet": 65, "downloader.w97m/jeki": 66, "downloader.w97m/msword": 67, "dropper.": 68, "dropper.fin7/ole2": 69, "dropper.x97m/blackenergy": 70, "eicar/file": 71, "exceldna/msil": 72, "expl": 73, "expl/mo97": 74, "expl/tiff": 75, "fakeav.": 76, "fakeav.andr/xgen": 77, "filerepmalware": 78, "filerepmalware/misc": 79, "gatak": 80, "hack/msfencode": 81, "hacktool.": 82, "hacktool.atera/msil": 83, "hacktool.boxter/nishang": 84, "hacktool.cobalt/bkdr": 85, "hacktool.connectscreen": 86, "hacktool.connectwise": 87, "hacktool.connectwise/remotetool": 88, "hacktool.fscan": 89, "hacktool.fscan/exploitsuggester": 90, "hacktool.fscan/scanner": 91, "hacktool.intercepter/intercep": 92, "hacktool.lazagne": 93, "hacktool.medusabrute": 94, "hacktool.mikatz": 95, "hacktool.mimikatz/hktl": 96, "hacktool.mimikatz/marte": 97, "hacktool.mimikatz/wincred": 98, "hacktool.ngrok/redcap": 99, "hacktool.nishang/hktl": 100, "hacktool.nishang/powershell": 101, "hacktool.nishang/webshell": 102, "hacktool.ophcrack/password": 103, "hacktool.perl/vulntest": 104, "hacktool.pingcastle": 105, "hacktool.powersploit/nishang": 106, "hacktool.powersploit/powerup": 107, "hacktool.processhacker": 108, "hacktool.processhacker/prochack": 109, "hacktool.pwdump/hktl": 110, "hacktool.pwdump/lsassdump": 111, "hacktool.pwdump/pswtool": 112, "hacktool.pyspy/stealer": 113, "hacktool.python": 114, "hacktool.python/sqlmap": 115, "hacktool.relsy": 116, "hacktool.relsy/genericrxmc": 117, "hacktool.ultravnc": 118, "hary/ibff": 119, "hiddad": 120, "htyb": 121, "insane": 122, "isher": 123, "keylogger/capturescreen": 124, "killav": 125, "luckypatcher/andr": 126, "luminati/lutimani": 127, "miner.": 128, "miner.generickdq/pvujj": 129, "miner.terow/xmrigminer": 130, "miner.xmrminer/malxmr": 131, "miraidownloader": 132, "misc": 133, "msil/telegrambot": 134, "nimda": 135, "nuitka/python": 136, "password/stealer": 137, "phishing.": 138, "phishing.acsogenixx/pjpf": 139, "phishing.gen2": 140, "phishing.gen2/phishingx": 141, "phishing.gen2/stealer": 142, "phishing.knowbe4": 143, "phishing.phishingx": 144, "pingcastle": 145, "processhacker": 146, "pua.": 147, "pua.fjhi/robtes": 148, "pua.processhacker/prochack": 149, "pua.prochack/processhacker": 150, "pua.robtes/fjhi": 151, "pua.securityxploded": 152, "pua.securityxploded/keygen": 153, "pua.securityxploded/misc": 154, "pwrsh": 155, "pyspy": 156, "python": 157, "ransomware.": 158, "ransomware.darkside/encoder": 159, "ransomware.petya/goldeneye": 160, "ransomware.python": 161, "ransomware.ryuk/smthc": 162, "remotetool": 163, "rozena": 164, "runner": 165, "securityxploded": 166, "shellcode": 167, "smsreg": 168, "spdrfoot": 169, "spyloan": 170, "tedy": 171, "trojan.": 172, "trojan.aagg/gamaredon": 173, "trojan.aagg/genericr": 174, "trojan.acan/based": 175, "trojan.adinject/cryxos": 176, "trojan.agentb": 177, "trojan.agentb/bulz": 178, "trojan.agentb/fitb": 179, "trojan.agentb/nukesped": 180, "trojan.agentwdcr/blocker": 181, "trojan.alevaul": 182, "trojan.alien": 183, "trojan.amphitryon/w97m": 184, "trojan.andr/xgen": 185, "trojan.androm/gamarue": 186, "trojan.antihosts": 187, "trojan.antihosts/mirai": 188, "trojan.apost": 189, "trojan.apost/bobik": 190, "trojan.apost/fehq": 191, "trojan.apost/graftor": 192, "trojan.apost/jaik": 193, "trojan.apost/micropsia": 194, "trojan.apost/midie": 195, "trojan.apost/pterodo": 196, "trojan.apost/revokery": 197, "trojan.apost/zusy": 198, "trojan.applockbypass": 199, "trojan.arcbomb/archbomb": 200, "trojan.artief/docswf": 201, "trojan.artief/flash": 202, "trojan.aspm": 203, "trojan.ausiv/emnr": 204, "trojan.autoit": 205, "trojan.autoit/autoitinject": 206, "trojan.autoit/nymeria": 207, "trojan.autoit/sednit": 208, "trojan.autorunner/mint": 209, "trojan.autoruns/gamaredon": 210, "trojan.autoruns/generickds": 211, "trojan.azorult/coins": 212, "trojan.babadeda": 213, "trojan.babar/cosmicduke": 214, "trojan.babar/sednit": 215, "trojan.banbra/filerepmalware": 216, "trojan.bancteian/fsysna": 217, "trojan.banload/symmi": 218, "trojan.barys": 219, "trojan.barys/chromeinject": 220, "trojan.barys/coins": 221, "trojan.barys/giant": 222, "trojan.barys/pemalform": 223, "trojan.barys/pswdump": 224, "trojan.based/aagg": 225, "trojan.based/gamaredon": 226, "trojan.bash/webshell": 227, "trojan.bazar/bazarloader": 228, "trojan.bdcc": 229, "trojan.beatbanker": 230, "trojan.beef": 231, "trojan.beef/psploitenc": 232, "trojan.betload": 233, "trojan.binder/drop": 234, "trojan.bingoml/ctsinf": 235, "trojan.blackenergy/blakken": 236, "trojan.blackenergy/fonten": 237, "trojan.blackenergy/rootkit": 238, "trojan.blackenergy2/python": 239, "trojan.blackmoon/hijacker": 240, "trojan.blackmoon/upatre": 241, "trojan.bladabindi/msil": 242, "trojan.blakken/blackenergy": 243, "trojan.blakken/tdss": 244, "trojan.blind/doina": 245, "trojan.blocker/msil": 246, "trojan.bnef/nukesped": 247, "trojan.bobik/apost": 248, "trojan.bobik/ulise": 249, "trojan.bodegun/agentb": 250, "trojan.bomber/cve201711882": 251, "trojan.bomber/macros": 252, "trojan.bomber/w97m": 253, "trojan.boogle": 254, "trojan.boogr": 255, "trojan.boxter/expl": 256, "trojan.boxter/msil": 257, "trojan.boxter/nishang": 258, "trojan.boxter/powershell": 259, "trojan.boxter/reverseshell": 260, "trojan.brresmon/aechu": 261, "trojan.brsecmon/cryptinject": 262, "trojan.brsecmon/tofsee": 263, "trojan.brsecmone/frhw": 264, "trojan.bulz": 265, "trojan.bulz/goldfinder": 266, "trojan.bulz/nukesped": 267, "trojan.bulz/pterodo": 268, "trojan.bulz/w97m": 269, "trojan.buzus": 270, "trojan.carbanak": 271, "trojan.casdet": 272, "trojan.ceoz/agentb": 273, "trojan.cerber": 274, "trojan.cerber/cber": 275, "trojan.cerber/encoder": 276, "trojan.cerber/torrentlocker": 277, "trojan.cerber/zerber": 278, "trojan.cerbu/gogm": 279, "trojan.chartres/heur2": 280, "trojan.chartres/w97m": 281, "trojan.chromeinject/chromelevator": 282, "trojan.chromelevator/barys": 283, "trojan.chromelevator/chromeinject": 284, "trojan.chromelevator/hack": 285, "trojan.chromelevator/pswdump": 286, "trojan.cloudlook/cozycar": 287, "trojan.cobalt/mint": 288, "trojan.cobaltstrike/cobalt": 289, "trojan.cobaltstrike/deepscan": 290, "trojan.cobaltstrike/dump": 291, "trojan.cobaltstrike/marte": 292, "trojan.cobaltstrike/pwsh": 293, "trojan.cobaltstrike/rozena": 294, "trojan.comet/darkkomet": 295, "trojan.cometer/razy": 296, "trojan.connectwise": 297, "trojan.connectwise/msil": 298, "trojan.connectwise/screenconnect": 299, "trojan.convagent": 300, "trojan.corona/sload": 301, "trojan.cosmicduke/agentwdcr": 302, "trojan.cosmicduke/backdoorx": 303, "trojan.cosmicduke/dhdv": 304, "trojan.cosmicduke/johnnie": 305, "trojan.cosmicduke/midie": 306, "trojan.cosmicduke/miniduke": 307, "trojan.cosmicduke/stealer": 308, "trojan.cosmicduke/zusy": 309, "trojan.cosmu/deepscan": 310, "trojan.cosmu/lamer": 311, "trojan.cosmu/mint": 312, "trojan.cozer/cozybear": 313, "trojan.cozer/cozyduke": 314, "trojan.cozer/mikey": 315, "trojan.cozybear/cozer": 316, "trojan.cozycar/satan": 317, "trojan.cozyduke/antisandbox": 318, "trojan.cozyduke/cozer": 319, "trojan.crack": 320, "trojan.cross/donoff": 321, "trojan.cross/fin7": 322, "trojan.cross/runner": 323, "trojan.cryfile/jaik": 324, "trojan.cryp": 325, "trojan.crypmodadv/msil": 326, "trojan.cryptoff/dacic": 327, "trojan.cryptoff/zusy": 328, "trojan.crysis/crusis": 329, "trojan.cryxos": 330, "trojan.cryxos/bhpq": 331, "trojan.cve20164117/flash": 332, "trojan.daclsrat": 333, "trojan.dakkatoni/otvjh": 334, "trojan.dapato/drop": 335, "trojan.darkgate/msil": 336, "trojan.darkkomet/comet": 337, "trojan.ddeexec": 338, "trojan.ddeexec/msexcel": 339, "trojan.ddos/ddosagent": 340, "trojan.dealio/installer": 341, "trojan.defz/gamaredon": 342, "trojan.delphocy/linupron": 343, "trojan.delphocy/sednit": 344, "trojan.denes/oceanlotus": 345, "trojan.denis/doina": 346, "trojan.destover/bgyp": 347, "trojan.destover/nukesped": 348, "trojan.dfct/bitmin": 349, "trojan.dfct/linkury": 350, "trojan.dinwod/ezho": 351, "trojan.dirtycow": 352, "trojan.disable/amsi": 353, "trojan.diskcoder/goldeneye": 354, "trojan.diskcoder/petr": 355, "trojan.diskwriter/agentwdcr": 356, "trojan.diskwriter/razy": 357, "trojan.diztakun/msil": 358, "trojan.dnscat2": 359, "trojan.doina": 360, "trojan.doina/agentb": 361, "trojan.doina/bafruz": 362, "trojan.doina/gamaredon": 363, "trojan.doina/joanap": 364, "trojan.doina/nukesped": 365, "trojan.doina/pterodo": 366, "trojan.doina/qhost": 367, "trojan.doina/stealer": 368, "trojan.doina/vkhost": 369, "trojan.donoff": 370, "trojan.donvibs": 371, "trojan.donvibs/carbanak": 372, "trojan.dorgam": 373, "trojan.dorgam/miscx": 374, "trojan.dothetuk/luminati": 375, "trojan.dreidel/mint": 376, "trojan.drop": 377, "trojan.dump/goldeneye": 378, "trojan.dump/marte": 379, "trojan.dumpex": 380, "trojan.eicar/test": 381, "trojan.eicv/aple": 382, "trojan.eicv/lamer": 383, "trojan.emailworm": 384, "trojan.emodldr/heur2": 385, "trojan.emodldr/w97m": 386, "trojan.emooodldr/docdl": 387, "trojan.emooodldr/w97m": 388, "trojan.emotet": 389, "trojan.emotet/dump": 390, "trojan.emotet/runner": 391, "trojan.emotetdldr/heur2": 392, "trojan.empire/powershell": 393, "trojan.encdoc/w97m": 394, "trojan.encdoc/x97m": 395, "trojan.encodedinjected/webshell": 396, "trojan.enistery": 397, "trojan.esso/sload": 398, "trojan.expiro": 399, "trojan.expl": 400, "trojan.expl/python": 401, "trojan.expl/remoteshell": 402, "trojan.faceliker/autolike": 403, "trojan.fakeinst": 404, "trojan.fbew/revokery": 405, "trojan.fbj2vjci/genome": 406, "trojan.fhscan/downware": 407, "trojan.filerepmalware/misc": 408, "trojan.fin7/ciav": 409, "trojan.fin7/cross": 410, "trojan.fin7/doclink": 411, "trojan.fin7/finsvn": 412, "trojan.fin7/msword": 413, "trojan.fin7/ole2": 414, "trojan.fin7/poweliks": 415, "trojan.fin7/runner": 416, "trojan.fin7/winlnk": 417, "trojan.flash/lodabytor": 418, "trojan.flystudio": 419, "trojan.fmqu/sload": 420, "trojan.fonten/blackenergy": 421, "trojan.foreign/doina": 422, "trojan.fqfv/spyagent": 423, "trojan.fragtor": 424, "trojan.fragtor/stealer": 425, "trojan.fraudrop/pterodo": 426, "trojan.fraudrop/wget": 427, "trojan.fraudrop/yzd6ypdgf": 428, "trojan.frvp": 429, "trojan.gachiloader": 430, "trojan.gafgyt/bashlite": 431, "trojan.gafgyt/ddos": 432, "trojan.gafgyt/generica": 433, "trojan.gafgyt/r002c0djl24": 434, "trojan.gamaredon": 435, "trojan.gamaredon/aagg": 436, "trojan.gamaredon/dgak": 437, "trojan.gamaredon/doina": 438, "trojan.gamaredon/driverpack": 439, "trojan.gamaredon/genericr": 440, "trojan.gamaredon/jaik": 441, "trojan.gamaredon/kowus": 442, "trojan.gamaredon/pterodo": 443, "trojan.gamaredon/resetter": 444, "trojan.gamaredon/suytiru": 445, "trojan.gamaredon/ursu": 446, "trojan.gamaredon/vawtrak": 447, "trojan.gamaredon/wget": 448, "trojan.gamaredon/winlnk": 449, "trojan.gamaredon/zapchast": 450, "trojan.gamarue/androm": 451, "trojan.gen2": 452, "trojan.gen2/phishingx": 453, "trojan.gen3": 454, "trojan.genericfca": 455, "trojan.genericfca/qhost": 456, "trojan.generickdq": 457, "trojan.generickdq/hpbj": 458, "trojan.generickdq/shellcode": 459, "trojan.generics/lnkexec": 460, "trojan.genw/ole2": 461, "trojan.ghol": 462, "trojan.giant/tedy": 463, "trojan.goldeneye/petya": 464, "trojan.goldmax/bulz": 465, "trojan.goldmax/sunshuttle": 466, "trojan.gosys/mofksys": 467, "trojan.graftor": 468, "trojan.graftor/apost": 469, "trojan.graftor/carbanak": 470, "trojan.graftor/kbdmai": 471, "trojan.graftor/miancha": 472, "trojan.graftor/stantinko": 473, "trojan.groooboor/docx": 474, "trojan.groooboor/frvp": 475, "trojan.groooboor/office": 476, "trojan.groooboor/pterodo": 477, "trojan.groooboor/subdoc": 478, "trojan.groooboor/w97m": 479, "trojan.guidzat/cobaltstrike": 480, "trojan.guloader/nsis": 481, "trojan.hancitor/heur2": 482, "trojan.hermes/encoder": 483, "trojan.heur2": 484, "trojan.heur2/obfdldr": 485, "trojan.heur2/powershell": 486, "trojan.heur2/pwshell": 487, "trojan.hiddad": 488, "trojan.hidelink": 489, "trojan.hosts2": 490, "trojan.hpbj": 491, "trojan.hudun": 492, "trojan.hupigon/ultrasurf": 493, "trojan.hybdlg/miniduke": 494, "trojan.ibashade/drolnux": 495, "trojan.iespy/dump": 496, "trojan.iespy/pfhybdlg": 497, "trojan.iframeexec": 498, "trojan.industroyer": 499, "trojan.industroyer/bkdr": 500, "trojan.industroyer/crashoverride": 501, "trojan.industroyer/genericrxdb": 502, "trojan.industroyer/idtroyer": 503, "trojan.ixeshe/fragtor": 504, "trojan.jaik": 505, "trojan.jaik/apost": 506, "trojan.jaik/badlnk": 507, "trojan.jaik/escad": 508, "trojan.jaik/gamaredon": 509, "trojan.jaik/ixeshe": 510, "trojan.jaik/nukesped": 511, "trojan.jaik/pterodo": 512, "trojan.jaik/stealer": 513, "trojan.jaik/vawtrak": 514, "trojan.jaik/wget": 515, "trojan.jakyllhyde/bulz": 516, "trojan.jatif/pakes": 517, "trojan.jatif/shelma": 518, "trojan.java/cve20121723": 519, "trojan.java/expl": 520, "trojan.java/genericgba": 521, "trojan.jeki/w97m": 522, "trojan.jiagu": 523, "trojan.joanap/doina": 524, "trojan.joanap/symmi": 525, "trojan.johnnie/kasperagent": 526, "trojan.joker": 527, "trojan.joker/amos": 528, "trojan.jsdropper/fin7": 529, "trojan.jsshell/perl": 530, "trojan.jsstealz": 531, "trojan.keygen": 532, "trojan.keygen/crre": 533, "trojan.keylogger": 534, "trojan.keylogger/keylog": 535, "trojan.keylogger/lxki": 536, "trojan.killdisk/mint": 537, "trojan.kingsoft": 538, "trojan.kubesploit/bczik": 539, "trojan.laburrak": 540, "trojan.laburrak/powershell": 541, "trojan.lazagne/htool": 542, "trojan.lazagne/python": 543, "trojan.lazarus": 544, "trojan.lazarus/daclsrat": 545, "trojan.lazarus/nukesped": 546, "trojan.lazarus/valyria": 547, "trojan.lazy": 548, "trojan.lazy/dapato": 549, "trojan.lazy/msil": 550, "trojan.lazy/pemalform": 551, "trojan.lazy/pyinstaller": 552, "trojan.lazy/python": 553, "trojan.lazy/stealer": 554, "trojan.linx/runner": 555, "trojan.loader/python": 556, "trojan.lodabytor/flash": 557, "trojan.logan/encdoc": 558, "trojan.logan/obfuse": 559, "trojan.logan/sagent": 560, "trojan.logan/w97m": 561, "trojan.lojack/doubleagent": 562, "trojan.lojax/doubleagent": 563, "trojan.loki/stop": 564, "trojan.lokibot/fareit": 565, "trojan.macrodrop/bulz": 566, "trojan.macros/obfdldr": 567, "trojan.malisher/marte": 568, "trojan.mansabo/bulz": 569, "trojan.manuscrypt/gandcrab": 570, "trojan.manuscrypt/nukesped": 571, "trojan.marsilia/msil": 572, "trojan.marte/shellcode": 573, "trojan.masqshell": 574, "trojan.mcazm/scar": 575, "trojan.mcazm/wget": 576, "trojan.meterpreter": 577, "trojan.mhtredir/mhtml": 578, "trojan.miancha/graftor": 579, "trojan.micropsia": 580, "trojan.micropsia/andr": 581, "trojan.micropsia/gnatspy": 582, "trojan.micropsia/ulise": 583, "trojan.midie/cosmicduke": 584, "trojan.midie/fowlgaze": 585, "trojan.midie/mikey": 586, "trojan.midie/miniduke": 587, "trojan.mikey": 588, "trojan.mikey/agentb": 589, "trojan.mikey/aqbn": 590, "trojan.mikey/qwexlafiba": 591, "trojan.mikey/stealer": 592, "trojan.mimikatz": 593, "trojan.mimikatz/apteryx": 594, "trojan.mimikatz/lazy": 595, "trojan.mimikatz/marte": 596, "trojan.minerva": 597, "trojan.minerva/webshell": 598, "trojan.miniduke/apt29": 599, "trojan.miniduke/babar": 600, "trojan.miniduke/bkdr": 601, "trojan.miniduke/cerbu": 602, "trojan.miniduke/cosmicduke": 603, "trojan.miniduke/doina": 604, "trojan.miniduke/dukin": 605, "trojan.miniduke/dypz": 606, "trojan.miniduke/famw": 607, "trojan.miniduke/jaik": 608, "trojan.miniduke/midie": 609, "trojan.miniduke/onionduke": 610, "trojan.miniduke/razy": 611, "trojan.miniduke/sandyeva": 612, "trojan.miniduke/spnr": 613, "trojan.miniflame": 614, "trojan.mint/pornoasset": 615, "trojan.mint/tofsee": 616, "trojan.mint/zamg": 617, "trojan.mint/zard": 618, "trojan.mirai": 619, "trojan.mirai/gafgyt": 620, "trojan.mirai/mibsun": 621, "trojan.miraidownloader": 622, "trojan.misc": 623, "trojan.misc/nwlnq": 624, "trojan.mofksys/gosys": 625, "trojan.mole/ixeshe": 626, "trojan.ms07/tiff": 627, "trojan.ms08/python": 628, "trojan.msidrop/msil": 629, "trojan.msil": 630, "trojan.msil/agensla": 631, "trojan.msil/agenttesla": 632, "trojan.msil/androm": 633, "trojan.msil/apost": 634, "trojan.msil/autoruns": 635, "trojan.msil/basic": 636, "trojan.msil/bladabindi": 637, "trojan.msil/bobik": 638, "trojan.msil/boxter": 639, "trojan.msil/bulz": 640, "trojan.msil/cerbu": 641, "trojan.msil/cryptpack": 642, "trojan.msil/crysan": 643, "trojan.msil/dacic": 644, "trojan.msil/dlkm": 645, "trojan.msil/dlko": 646, "trojan.msil/gandcrab": 647, "trojan.msil/jalapeno": 648, "trojan.msil/jssloader": 649, "trojan.msil/loki": 650, "trojan.msil/marsilia": 651, "trojan.msil/marte": 652, "trojan.msil/msilheracles": 653, "trojan.msil/msilperseus": 654, "trojan.msil/oceandrive": 655, "trojan.msil/oceanmap": 656, "trojan.msil/olock": 657, "trojan.msil/pterodo": 658, "trojan.msil/quietsieve": 659, "trojan.msil/rapidstealer": 660, "trojan.msil/razy": 661, "trojan.msil/redline": 662, "trojan.msil/rigol": 663, "trojan.msil/rozena": 664, "trojan.msil/stealer": 665, "trojan.msil/turla": 666, "trojan.msilheracles": 667, "trojan.msilheracles/msil": 668, "trojan.msilperseus/msil": 669, "trojan.msofficeword/generickds": 670, "trojan.msword": 671, "trojan.msword/droppr": 672, "trojan.msword/ginwui": 673, "trojan.msword/shellcode": 674, "trojan.msword/w97m": 675, "trojan.muddywater/aevh": 676, "trojan.mydoom/dump": 677, "trojan.mydoom/mudrop": 678, "trojan.nadrac/invader": 679, "trojan.netcat/bouncer": 680, "trojan.ngrok/redcap": 681, "trojan.nimda/bdcc": 682, "trojan.nishang/boxter": 683, "trojan.nishang/powershell": 684, "trojan.nsanti/blakken": 685, "trojan.nsis": 686, "trojan.nsis/osiris": 687, "trojan.nuitka/python": 688, "trojan.nukesped": 689, "trojan.nukesped/aael": 690, "trojan.nukesped/agentb": 691, "trojan.nukesped/bnef": 692, "trojan.nukesped/bulz": 693, "trojan.nukesped/dump": 694, "trojan.nukesped/jaik": 695, "trojan.nukesped/lazarus": 696, "trojan.nukesped/mikey": 697, "trojan.nukesped/nukespeed": 698, "trojan.obfdldr": 699, "trojan.obfdldr/heur2": 700, "trojan.obfscred/gen2": 701, "trojan.obfsstrm/cve2017": 702, "trojan.obfsstrm/expl": 703, "trojan.oceanlotus/bbak": 704, "trojan.oceanlotus/ulise": 705, "trojan.oceanlotus/zusy": 706, "trojan.office": 707, "trojan.office/w97m": 708, "trojan.oilrig/msil": 709, "trojan.ole2": 710, "trojan.ole2/powershell": 711, "trojan.ole2/w97m": 712, "trojan.onestart/generickdq": 713, "trojan.onionduke/babar": 714, "trojan.onionduke/midie": 715, "trojan.onionduke/miniduke": 716, "trojan.onlinegames/zusy": 717, "trojan.ophcrack/pswtool": 718, "trojan.owaphish": 719, "trojan.pakes/genericfca": 720, "trojan.pakes/hckpk": 721, "trojan.pakes/sekur": 722, "trojan.pantera/gamaredon": 723, "trojan.pantera/powershell": 724, "trojan.pantera/powsheldow": 725, "trojan.peaceduke/seaduke": 726, "trojan.pemalform": 727, "trojan.pemalform/enistery": 728, "trojan.pemalform/lazy": 729, "trojan.pemalform/sodinokibi": 730, "trojan.penterware": 731, "trojan.perl/trapset": 732, "trojan.petya/goldeneye": 733, "trojan.pfhybdlg/iespy": 734, "trojan.phantomshell/powershell": 735, "trojan.phishingx": 736, "trojan.pidief/pdfka": 737, "trojan.pidief/ynlj": 738, "trojan.plankton/apperhand": 739, "trojan.poqsp/xmrigminer": 740, "trojan.posh": 741, "trojan.powbow/asusd": 742, "trojan.poweliks/fin7": 743, "trojan.poweliks/msword": 744, "trojan.powershell": 745, "trojan.powershell/bondupdater": 746, "trojan.powershell/boxter": 747, "trojan.powershell/bynoco": 748, "trojan.powershell/fiyn": 749, "trojan.powershell/fiyo": 750, "trojan.powershell/gatethief": 751, "trojan.powershell/malgent": 752, "trojan.powershell/powersploit": 753, "trojan.powershell/splitfuse": 754, "trojan.powersploit/powershell": 755, "trojan.praetoria/fin7": 756, "trojan.praetoria/w97m": 757, "trojan.presenoker": 758, "trojan.pterodo": 759, "trojan.pterodo/agmhriek": 760, "trojan.pterodo/apost": 761, "trojan.pterodo/cerbu": 762, "trojan.pterodo/doina": 763, "trojan.pterodo/filerepmalware": 764, "trojan.pterodo/fragtor": 765, "trojan.pterodo/gamaredon": 766, "trojan.pterodo/genericrxsb": 767, "trojan.pterodo/graftor": 768, "trojan.pterodo/jaik": 769, "trojan.pterodo/symmi": 770, "trojan.pterodo/uiruni": 771, "trojan.pwrsh": 772, "trojan.pwshell": 773, "trojan.pwshell/anunak": 774, "trojan.pwshell/carbanak": 775, "trojan.pwshell/heur2": 776, "trojan.pwshell/x97m": 777, "trojan.pykspa/blocker": 778, "trojan.python": 779, "trojan.python/loader": 780, "trojan.python/ms08": 781, "trojan.python/nuitka": 782, "trojan.python/pbot": 783, "trojan.python/shellloader": 784, "trojan.python/telebot": 785, "trojan.python/voldemortagent": 786, "trojan.qhost": 787, "trojan.qhost/zusy": 788, "trojan.qqpass": 789, "trojan.qrcode": 790, "trojan.r8xe52ib/elmer": 791, "trojan.ramnit/abcg": 792, "trojan.rasftuby/scar": 793, "trojan.razy/adload": 794, "trojan.razy/gogm": 795, "trojan.razy/reposfxg": 796, "trojan.razy/trickbot": 797, "trojan.razy/zmem": 798, "trojan.reddust": 799, "trojan.relsy/cerber": 800, "trojan.remeshelsz/amsibypass": 801, "trojan.reverseshell/python": 802, "trojan.revokery/apost": 803, "trojan.rootkit/blakken": 804, "trojan.runner": 805, "trojan.runner/carbanak": 806, "trojan.sagent": 807, "trojan.sagent/argo1": 808, "trojan.salgorea/ayzg": 809, "trojan.sality/salitystub": 810, "trojan.sandr/kasandra": 811, "trojan.satan/cloudduke": 812, "trojan.satan/cloudlook": 813, "trojan.scam": 814, "trojan.scar/marsilia": 815, "trojan.sconato/auhm": 816, "trojan.sconato/wanna": 817, "trojan.scrypted/w97m": 818, "trojan.seaduke/python": 819, "trojan.secneo": 820, "trojan.securityxploded": 821, "trojan.securityxploded/filerepmalware": 822, "trojan.sednit": 823, "trojan.sednit/fugrafa": 824, "trojan.sednit/graftor": 825, "trojan.sednit/sofacy": 826, "trojan.sednit/strictor": 827, "trojan.sednit/zebrocy": 828, "trojan.sekur/fugrafa": 829, "trojan.seven": 830, "trojan.seven/botx": 831, "trojan.seven/lockfile": 832, "trojan.sfpfhybdpk/dump": 833, "trojan.shell/bash": 834, "trojan.shellcode": 835, "trojan.shellcode/cobalt": 836, "trojan.shellcode/marte": 837, "trojan.shellcode/stop": 838, "trojan.shelma/bazaloader": 839, "trojan.shelma/dump": 840, "trojan.shelma/variadic": 841, "trojan.shiz/dacic": 842, "trojan.shiz/fragtor": 843, "trojan.shiz/simda": 844, "trojan.shlem/bazaloader": 845, "trojan.silentall/autoit": 846, "trojan.sload": 847, "trojan.smsreg": 848, "trojan.sofacy/aznk": 849, "trojan.sofacy/graftor": 850, "trojan.sofacy/lazy": 851, "trojan.sofacy/sednit": 852, "trojan.sofacy/ursu": 853, "trojan.sofacy/usbstealer": 854, "trojan.sorefang/zusy": 855, "trojan.spyagent": 856, "trojan.spyagent/spyc23": 857, "trojan.spyagent/spymax": 858, "trojan.spyagent/spynote": 859, "trojan.spyagent/sris": 860, "trojan.spyc23/aridgopher": 861, "trojan.spymax/spynote": 862, "trojan.spynote/spymax": 863, "trojan.starter/pterodo": 864, "trojan.starter/wget": 865, "trojan.startpage/spigot": 866, "trojan.startpage/winwrapper": 867, "trojan.stealer": 868, 