{
  "sha256": "797159c202ca41356bee18c5303d37e9d2a43ca43d0ce02e1fd9e7045b925d11",
  "query_time": "2026-03-24T06:25:22.907983+00:00",
  "contacted_ips": [],
  "contacted_domains": [],
  "dropped_files": [],
  "execution_parents": [],
  "errors": [],
  "contacted_urls": [],
  "bundled_files": [
    {
      "id": "af5570f5a1810b7af78caf4bc70a660f0df51e42baf91d4de5b2328de0e83dfc",
      "attributes": {
        "type_tags": [],
        "reputation": 41,
        "meaningful_name": "PetsApp.svgbundle",
        "first_submission_date": 1234710689,
        "sandbox_verdicts": {
          "Zenbox": {
            "category": "harmless",
            "malware_classification": [
              "CLEAN"
            ],
            "sandbox_name": "Zenbox",
            "confidence": 100
          }
        },
        "magika": "UNKNOWN",
        "filecondis": {
          "dhash": "8100000000000000",
          "raw_md5": "74fdc86dc8f2090138709827f975d323"
        },
        "known_distributors": {
          "distributors": [
            "Microsoft",
            "Apple",
            "TMSOFT"
          ],
          "filenames": [
            "__DATA__objc_superrefs",
            "__DATA_CONST__objc_imageinfo",
            "model.espresso.weights",
            "ivs-1.2.0_quantized_sqdev.espresso.weights",
            ".data",
            "ivs-1.5.0_quantized_sqdev.espresso.weights",
            "ivs-1.3.0_quantized_sqdev.espresso.weights",
            "__DATA__objc_classrefs",
            "__DATA__data",
            "ivs-1.3.0_quantized_sqdev.espresso.weights-af5570f5a1810b7af78caf4bc70a660f0df51e42baf91d4de5b2328de0e83dfc",
            "__DATA_CONST__got",
            "__DATA__objc_imageinfo",
            "PetsApp.svgbundle",
            "coremldata.bin",
            ".ARM.exidx-af5570f5a1810b7af78caf4bc70a660f0df51e42baf91d4de5b2328de0e83dfc",
            "__DATA__got"
          ],
          "products": [
            "Da Vinci Eye: AR Art Projector",
            "062-78643-13.7-22H123",
            "First State Bank",
            "072-01382-%!s(<nil>)-%!s(<nil>)",
            "Phemex: Crypto & BTC Trading",
            "072-00427-%!s(<nil>)-%!s(<nil>)",
            "Food Truck ChefTM Cooking Games",
            "Tax Return Germany | Steuer Go",
            "072-12353-%!s(<nil>)-%!s(<nil>)",
            "Amp Live Radio: Music & Talk",
            "062-80466-%!s(<nil>)-%!s(<nil>)",
            "062-64510-%!s(<nil>)-%!s(<nil>)",
            "062-78824-14.7-23H124",
            "072-12295-%!s(<nil>)-%!s(<nil>)",
            "062-71934-%!s(<nil>)-%!s(<nil>)",
            "Banks Power",
            "Bloons TD 5",
            "Rent Please! Landlord Sim",
            "Amazon Music: Songs & Podcasts",
            "Liberty Tax",
            "Win Real Money with Coinnect",
            "052-69919-14.6-23G80",
            "062-78429-%!s(<nil>)-%!s(<nil>)",
            "072-09041-14.7.1-23H222",
            "062-40406-12.7.6-21H1320",
            "HulaVPN Pro - Fast Secure VPN",
            "Mutual of Omaha Mortgage",
            "Seeking Alpha: News & Analysis",
            "062-58676-14.6.1-23G93",
            "Bloons TD 6",
            "062-40406-%!s(<nil>)-%!s(<nil>)",
            "Invoice2go: Easy Invoice Maker",
            "4FrontGo",
            "062-53088-%!s(<nil>)-%!s(<nil>)",
            "Amazon Alexa",
            "Doodle GodTM",
            "Capital One CreditWise",
            "072-09041-%!s(<nil>)-%!s(<nil>)",
            "Best Buy",
            "062-78643-%!s(<nil>)-%!s(<nil>)",
            "062-58676-%!s(<nil>)-%!s(<nil>)",
            "062-53088-13.6.9-22G830",
            "062-45761-%!s(<nil>)-%!s(<nil>)",
            "062-39980-13.6.8-22G820",
            "062-39980-%!s(<nil>)-%!s(<nil>)",
            "White Noise",
            "Money Transfer App Paysend",
            "Easy Invoice Maker App",
            "072-09024-13.7.1-22H221",
            "072-05999-%!s(<nil>)-%!s(<nil>)",
            "062-91076-%!s(<nil>)-%!s(<nil>)",
            "Capital One Mobile",
            "Tax Return: Lohnsteuer kompakt",
            "072-09024-%!s(<nil>)-%!s(<nil>)",
            "062-78824-%!s(<nil>)-%!s(<nil>)",
            "062-59148-%!s(<nil>)-%!s(<nil>)",
            "TD Bank (US)",
            "Terraria",
            "Churchill Mortgage Corporation",
            "052-69919-%!s(<nil>)-%!s(<nil>)"
          ],
          "data_sources": [
            "Microsoft Corporation",
            "HashDB",
            "National Software Reference Library (NSRL)",
            "monitor_hashdb_apple",
            "monitor_hashdb_microsoft"
          ]
        },
        "total_votes": {
          "harmless": 3,
          "malicious": 9
        },
        "sha1": "05fe405753166f125559e7c9ac558654f107c7e9",
        "tags": [
          "known-distributor",
          "nsrl",
          "zero-filled",
          "idle",
          "trusted",
          "via-tor"
        ],
        "unique_sources": 443,
        "trusted_verdict": {
          "organization": "Microsoft Corporation",
          "verdict": "goodware",
          "generator": "Microsoft Corporation",
          "filename": "PetsApp.svgbundle"
        },
        "last_analysis_date": 1773612299,
        "sha256": "af5570f5a1810b7af78caf4bc70a660f0df51e42baf91d4de5b2328de0e83dfc",
        "ssdeep": "3::",
        "size": 8,
        "last_analysis_results": {
          "Bkav": {
            "method": "blacklist",
            "engine_name": "Bkav",
            "engine_version": "2.0.0.1",
            "engine_update": "20260314",
            "category": "undetected",
            "result": null
          },
          "Lionic": {
            "method": "blacklist",
            "engine_name": "Lionic",
            "engine_version": "8.16",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "MicroWorld-eScan": {
            "method": "blacklist",
            "engine_name": "MicroWorld-eScan",
            "engine_version": "14.0.409.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "ClamAV": {
            "method": "blacklist",
            "engine_name": "ClamAV",
            "engine_version": "1.5.2.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "CMC": {
            "method": "blacklist",
            "engine_name": "CMC",
            "engine_version": "2.4.2022.1",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "CAT-QuickHeal": {
            "method": "blacklist",
            "engine_name": "CAT-QuickHeal",
            "engine_version": "22.00",
            "engine_update": "20260314",
            "category": "undetected",
            "result": null
          },
          "Skyhigh": {
            "method": "blacklist",
            "engine_name": "Skyhigh",
            "engine_version": "v2021.2.0+4045",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "ALYac": {
            "method": "blacklist",
            "engine_name": "ALYac",
            "engine_version": "2.0.0.10",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Malwarebytes": {
            "method": "blacklist",
            "engine_name": "Malwarebytes",
            "engine_version": "3.1.0.211",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "VIPRE": {
            "method": "blacklist",
            "engine_name": "VIPRE",
            "engine_version": "6.0.0.35",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Sangfor": {
            "method": "blacklist",
            "engine_name": "Sangfor",
            "engine_version": "2.22.3.0",
            "engine_update": "20260313",
            "category": "undetected",
            "result": null
          },
          "K7AntiVirus": {
            "method": "blacklist",
            "engine_name": "K7AntiVirus",
            "engine_version": "14.41.58888",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "K7GW": {
            "method": "blacklist",
            "engine_name": "K7GW",
            "engine_version": "14.41.58888",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "CrowdStrike": {
            "method": "blacklist",
            "engine_name": "CrowdStrike",
            "engine_version": "1.0",
            "engine_update": "20230417",
            "category": "undetected",
            "result": null
          },
          "Arcabit": {
            "method": "blacklist",
            "engine_name": "Arcabit",
            "engine_version": "2025.0.0.23",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Baidu": {
            "method": "blacklist",
            "engine_name": "Baidu",
            "engine_version": "1.0.0.2",
            "engine_update": "20190318",
            "category": "undetected",
            "result": null
          },
          "VirIT": {
            "method": "blacklist",
            "engine_name": "VirIT",
            "engine_version": "9.5.1165",
            "engine_update": "20260313",
            "category": "undetected",
            "result": null
          },
          "Symantec": {
            "method": "blacklist",
            "engine_name": "Symantec",
            "engine_version": "1.22.0.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "ESET-NOD32": {
            "method": "blacklist",
            "engine_name": "ESET-NOD32",
            "engine_version": "18.2.18.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "TrendMicro-HouseCall": {
            "method": "blacklist",
            "engine_name": "TrendMicro-HouseCall",
            "engine_version": "24.550.0.1002",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Avast": {
            "method": "blacklist",
            "engine_name": "Avast",
            "engine_version": "23.9.8494.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Cynet": {
            "method": "blacklist",
            "engine_name": "Cynet",
            "engine_version": "4.0.3.4",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Kaspersky": {
            "method": "blacklist",
            "engine_name": "Kaspersky",
            "engine_version": "22.0.1.28",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "BitDefender": {
            "method": "blacklist",
            "engine_name": "BitDefender",
            "engine_version": "7.2",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "NANO-Antivirus": {
            "method": "blacklist",
            "engine_name": "NANO-Antivirus",
            "engine_version": "1.0.170.26895",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "SUPERAntiSpyware": {
            "method": "blacklist",
            "engine_name": "SUPERAntiSpyware",
            "engine_version": "5.6.0.1032",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Tencent": {
            "method": "blacklist",
            "engine_name": "Tencent",
            "engine_version": "1.0.0.1",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Sophos": {
            "method": "blacklist",
            "engine_name": "Sophos",
            "engine_version": "3.3.1.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "F-Secure": {
            "method": "blacklist",
            "engine_name": "F-Secure",
            "engine_version": "18.10.1547.307",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "DrWeb": {
            "method": "blacklist",
            "engine_name": "DrWeb",
            "engine_version": "7.0.75.2070",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Zillya": {
            "method": "blacklist",
            "engine_name": "Zillya",
            "engine_version": "2.0.0.5563",
            "engine_update": "20260313",
            "category": "undetected",
            "result": null
          },
          "TrendMicro": {
            "method": "blacklist",
            "engine_name": "TrendMicro",
            "engine_version": "24.550.0.1002",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "McAfeeD": {
            "method": "blacklist",
            "engine_name": "McAfeeD",
            "engine_version": "1.2.0.14035",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "CTX": {
            "method": "blacklist",
            "engine_name": "CTX",
            "engine_version": "2024.8.29.1",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Emsisoft": {
            "method": "blacklist",
            "engine_name": "Emsisoft",
            "engine_version": "2024.8.0.61147",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Ikarus": {
            "method": "blacklist",
            "engine_name": "Ikarus",
            "engine_version": "6.4.16.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Jiangmin": {
            "method": "blacklist",
            "engine_name": "Jiangmin",
            "engine_version": "16.0.100",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Google": {
            "method": "blacklist",
            "engine_name": "Google",
            "engine_version": "1773604830",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Avira": {
            "method": "blacklist",
            "engine_name": "Avira",
            "engine_version": "8.3.3.24",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Antiy-AVL": {
            "method": "blacklist",
            "engine_name": "Antiy-AVL",
            "engine_version": "3.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Kingsoft": {
            "method": "blacklist",
            "engine_name": "Kingsoft",
            "engine_version": "None",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Gridinsoft": {
            "method": "blacklist",
            "engine_name": "Gridinsoft",
            "engine_version": "1.0.241.174",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Xcitium": {
            "method": "blacklist",
            "engine_name": "Xcitium",
            "engine_version": "38486",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Microsoft": {
            "method": "blacklist",
            "engine_name": "Microsoft",
            "engine_version": "1.1.26010.1",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "ViRobot": {
            "method": "blacklist",
            "engine_name": "ViRobot",
            "engine_version": "2014.3.20.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "ZoneAlarm": {
            "method": "blacklist",
            "engine_name": "ZoneAlarm",
            "engine_version": "6.23-113518943",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "GData": {
            "method": "blacklist",
            "engine_name": "GData",
            "engine_version": "GD:27.43868AVA:64.30849",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Varist": {
            "method": "blacklist",
            "engine_name": "Varist",
            "engine_version": "6.6.1.3",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "AhnLab-V3": {
            "method": "blacklist",
            "engine_name": "AhnLab-V3",
            "engine_version": "3.29.1.10604",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Acronis": {
            "method": "blacklist",
            "engine_name": "Acronis",
            "engine_version": "1.2.0.121",
            "engine_update": "20240328",
            "category": "undetected",
            "result": null
          },
          "VBA32": {
            "method": "blacklist",
            "engine_name": "VBA32",
            "engine_version": "5.5.1",
            "engine_update": "20260313",
            "category": "undetected",
            "result": null
          },
          "TACHYON": {
            "method": "blacklist",
            "engine_name": "TACHYON",
            "engine_version": "2026-03-14.02",
            "engine_update": "20260314",
            "category": "undetected",
            "result": null
          },
          "Zoner": {
            "method": "blacklist",
            "engine_name": "Zoner",
            "engine_version": "2.2.2.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Rising": {
            "method": "blacklist",
            "engine_name": "Rising",
            "engine_version": "25.0.0.28",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Yandex": {
            "method": "blacklist",
            "engine_name": "Yandex",
            "engine_version": "5.5.2.24",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "TrellixENS": {
            "method": "blacklist",
            "engine_name": "TrellixENS",
            "engine_version": "6.0.6.653",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "huorong": {
            "method": "blacklist",
            "engine_name": "huorong",
            "engine_version": "783de06:783de06:97528e7:97528e7",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "MaxSecure": {
            "method": "blacklist",
            "engine_name": "MaxSecure",
            "engine_version": "1.0.0.1",
            "engine_update": "20260313",
            "category": "undetected",
            "result": null
          },
          "Fortinet": {
            "method": "blacklist",
            "engine_name": "Fortinet",
            "engine_version": "7.0.30.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "AVG": {
            "method": "blacklist",
            "engine_name": "AVG",
            "engine_version": "23.9.8494.0",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "Panda": {
            "method": "blacklist",
            "engine_name": "Panda",
            "engine_version": "4.6.4.2",
            "engine_update": "20260315",
            "category": "undetected",
            "result": null
          },
          "alibabacloud": {
            "method": "blacklist",
            "engine_name": "alibabacloud",
            "engine_version": "2.2.0",
            "engine_update": "20250321",
            "category": "undetected",
            "result": null
          },
          "Avast-Mobile": {
            "method": "blacklist",
            "engine_name": "Avast-Mobile",
            "engine_version": "260315-02",
            "engine_update": "20260315",
            "category": "type-unsupported",
            "result": null
          },
          "SymantecMobileInsight": {
            "method": "blacklist",
            "engine_name": "SymantecMobileInsight",
            "engine_version": "2.0",
            "engine_update": "20260123",
            "category": "type-unsupported",
            "result": null
          },
          "BitDefenderFalx": {
            "method": "blacklist",
            "engine_name": "BitDefenderFalx",
            "engine_version": "2.0.936",
            "engine_update": "20251216",
            "category": "type-unsupported",
            "result": null
          },
          "DeepInstinct": {
            "method": "blacklist",
            "engine_name": "DeepInstinct",
            "engine_version": "5.0.0.8",
            "engine_update": "20260312",
            "category": "type-unsupported",
            "result": null
          },
          "Elastic": {
            "method": "blacklist",
            "engine_name": "Elastic",
            "engine_version": "4.0.252",
            "engine_update": "20260311",
            "category": "type-unsupported",
            "result": null
          },
          "APEX": {
            "method": "blacklist",
            "engine_name": "APEX",
            "engine_version": "6.758",
            "engine_update": "20260313",
            "category": "type-unsupported",
            "result": null
          },
          "Paloalto": {
            "method": "blacklist",
            "engine_name": "Paloalto",
            "engine_version": "0.9.0.1003",
            "engine_update": "20260315",
            "category": "type-unsupported",
            "result": null
          },
          "Trapmine": {
            "method": "blacklist",
            "engine_name": "Trapmine",
            "engine_version": "4.0.10.0",
            "engine_update": "20260224",
            "category": "type-unsupported",
            "result": null
          },
          "Alibaba": {
            "method": "blacklist",
            "engine_name": "Alibaba",
            "engine_version": "0.3.0.5",
            "engine_update": "20190527",
            "category": "type-unsupported",
            "result": null
          },
          "Webroot": {
            "method": "blacklist",
            "engine_name": "Webroot",
            "engine_version": "1.9.0.8",
            "engine_update": "20250227",
            "category": "type-unsupported",
            "result": null
          },
          "Cylance": {
            "method": "blacklist",
            "engine_name": "Cylance",
            "engine_version": "3.0.0.0",
            "engine_update": "20260313",
            "category": "type-unsupported",
            "result": null
          },
          "SentinelOne": {
            "method": "blacklist",
            "engine_name": "SentinelOne",
            "engine_version": "7.5.3.1",
            "engine_update": "20251224",
            "category": "type-unsupported",
            "result": null
          },
          "tehtris": {
            "method": "blacklist",
            "engine_name": "tehtris",
            "engine_version": null,
            "engine_update": "20260315",
            "category": "type-unsupported",
            "result": null
          },
          "Trustlook": {
            "method": "blacklist",
            "engine_name": "Trustlook",
            "engine_version": "1.0",
            "engine_update": "20260315",
            "category": "type-unsupported",
            "result": null
          }
        },
        "tlsh": "TNULL",
        "first_seen_itw_date": 1263282215,
        "last_modification_date": 1774333499,
        "md5": "7dea362b3fac8e00956a4952a3d4f474",
        "wireshark": {
          "pcap": {
            "File encapsulation": "",
            "File type": ""
          }
        },
        "nsrl_info": {
          "products": [
            "DirectX (Microsoft)",
            "Windows Logo Hardware Compatability Test Kit for Windows XP (Microsoft)",
            "Platform SDK (Microsoft)",
            "DirectX SDK (Microsoft)",
            "Platforms, SDKs/DDKs (Microsoft)",
            "Platforms SDKs/DDKs (Microsoft)",
            "Platforms, Servers, Applications, SDK/DDK (Microsoft)",
            "SunSolve (Sun Microsystems)",
            "Windows Hardware Compatibility Test Kit (Microsoft)",
            "Platforms, SDK/DDK, Developer Tools (Microsoft)",
            "Platforms, SDK/DDK (Microsoft)",
            "Developer Tools, Platforms, SDK/DDK, Applications (Microsoft)",
            "Internet Explorer Versions (Microsoft)",
            "Exchange 2003 Server (Microsoft)",
            "Encyclopedia Britannica (Encyclopedia Britannica)",
            "MSDN Disc 2085 (Microsoft)",
            "Hackers Encyclopedia 2002 (Whirlwind Software)",
            "PC Maintenance (Bytesize CD-ROM Inc.)",
            "msdn Internet Explorer/ windows2000 Server (Microsoft)",
            "MSDN Disc 2427.1 (Microsoft)"
          ],
          "filenames": [
            "selpin.frx",
            "RASBVT.TST.310E1E6E_B3D4_4A4A_BA3B_06421E170A6C, RASBVT.TST.FFA706F0_B275_42B0_AC06_9ADE6D180424",
            "selpin_frx.581D774E_25AA_4841_A9DC_9332C3767342",
            "selpin_frx.138B9D33_4030_4A78_9547_C19E32A3E164",
            "RASBVT.TST.310E1E6E_B3D4_4A4A_BA3B_06421E170A6C, RASBVT.TST.FFA706F0_B275_42B0_AC06_9ADE6D180424, selpin_frx.138B9D33_4030_4A78_9547_C19E32A3E164",
            "ISCDA",
            "Selpin_frx.A010BB67_715A_4D91_8A6D_C3935A74AA86",
            "Device_NDIS40_i386RASBVT.TST, Device_NDIS40_ia64RASBVT.TST",
            "Device_NDIS40_i386RASBVT.TST, Device_NDIS40_ia64RASBVT.TST, Selpin_frx.A010BB67_715A_4D91_8A6D_C3935A74AA86",
            "DUAL.pidx",
            "frmSite.frx",
            "_FRDSRC_",
            "General.sav",
            "UserOpts.frx",
            "appletData",
            "SELPIN.FRX, selpin_frx.581D774E_25AA_4841_A9DC_9332C3767342",
            "RASBVT.TST",
            "ARRAY.FRX",
            "AUTHORINFO.pidx",
            "frmLayoutControl.frx"
          ]
        },
        "magic": "data",
        "monitor_info": {
          "organizations": [
            "Apple",
            "Microsoft"
          ],
          "filenames": [
            "ivs-1.3.0_quantized_sqdev.espresso.weights-af5570f5a1810b7af78caf4bc70a660f0df51e42baf91d4de5b2328de0e83dfc",
            ".ARM.exidx-af5570f5a1810b7af78caf4bc70a660f0df51e42baf91d4de5b2328de0e83dfc"
          ]
        },
        "type_description": "unknown",
        "last_analysis_stats": {
          "malicious": 0,
          "suspicious": 0,
          "undetected": 62,
          "harmless": 0,
          "timeout": 0,
          "confirmed-timeout": 0,
          "failure": 0,
          "type-unsupported": 14
        },
        "names": [
          "__DATA__nl_symbol_ptr",
          "[2]",
          "[1]",
          ".data.rel.local.DW.ref.__gxx_personality_v0",
          ".data.rel.ro",
          "__DATA__data",
          ".init_array",
          ".jcr",
          "filewrapper_toc",
          "__DATA__objc_imageinfo",
          ".fini_array",
          "__DATA__got",
          ".padding",
          "__DATA__objc_classrefs",
          ".tls",
          ".got",
          "__TEXT__const",
          ".data",
          "__DATA_DIRTY__data",
          "coremldata.bin",
          "__DATA_CONST__got",
          ".data.rel.local.DW.ref._ZTISt9bad_alloc",
          ".data.rel.local",
          ".CRT$XCU",
          ".reloc",
          "mapEditorSettings.bin",
          "conditional_restrictions",
          "timestamp.meta",
          "node_sequences.meta",
          "overrides.meta",
          "201",
          "[0]",
          ".data.rel.ro..L__const.pf_install_api.params",
          "431",
          "__DATA__thread_bss",
          "1003143.bin",
          "1002791.bin",
          ".rtc$IMZ",
          ".rtc$TMZ",
          "430",
          "432",
          "433",
          "434",
          "435",
          "436",
          "437",
          "438",
          "439",
          "440",
          "441",
          "442",
          "443",
          "444",
          "445",
          "446",
          "447",
          "448",
          "449",
          "450",
          "451",
          "452",
          "453",
          "454",
          "455",
          "456",
          "457",
          "458",
          "459",
          "460",
          "461",
          "462",
          "463",
          "464",
          "465",
          "490",
          "491",
          "492",
          "493",
          "494",
          "495",
          "496",
          "497",
          "498",
          "499",
          "500",
          "501",
          "502",
          "503",
          "504",
          "505",
          "506",
          "507",
          "508"
        ],
        "last_submission_date": 1774172354,
        "times_submitted": 978
      }
    },
    {
      "id": "c6c7c8ba03e7a2f11b0c76176c32dcdf066c2b7783da55959a7083dbdd88177e",
      "attributes": {
        "type_tags": [],
        "reputation": 0,
        "meaningful_name": ".got",
        "first_submission_date": 1361461330,
        "trid": [
          {
            "file_type": "null bytes",
            "probability": 88.8
          },
          {
            "file_type": "HomeLab/BraiLab Tape image",
            "probability": 11.1
          },
          {
            "file_type": "MacBinary 1",
            "probability": 0.0
          },
          {
            "file_type": "Adobe PhotoShop Brush",
            "probability": 0.0
          },
          {
            "file_type": "Memo File Apollo Database Engine",
            "probability": 0.0
          }
        ],
        "total_votes": {
          "harmless": 0,
          "malicious": 0
        },
        "sha1": "1b0117cddc6ff8e0017152d9a71b6c6dcab59f06",
        "tags": [
          "zero-filled"
        ],
        "unique_sources": 2,
        "last_analysis_date": 1705919969,
        "sha256": "c6c7c8ba03e7a2f11b0c76176c32dcdf066c2b7783da55959a7083dbdd88177e",
        "ssdeep": "3::",
        "size": 176976,
        "last_analysis_results": {
          "Bkav": {
            "method": "blacklist",
            "engine_name": "Bkav",
            "engine_version": "2.0.0.1",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Lionic": {
            "method": "blacklist",
            "engine_name": "Lionic",
            "engine_version": "7.5",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "MicroWorld-eScan": {
            "method": "blacklist",
            "engine_name": "MicroWorld-eScan",
            "engine_version": "14.0.409.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "ClamAV": {
            "method": "blacklist",
            "engine_name": "ClamAV",
            "engine_version": "1.2.1.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "CMC": {
            "method": "blacklist",
            "engine_name": "CMC",
            "engine_version": "2.4.2022.1",
            "engine_update": "20240106",
            "category": "undetected",
            "result": null
          },
          "CAT-QuickHeal": {
            "method": "blacklist",
            "engine_name": "CAT-QuickHeal",
            "engine_version": "22.00",
            "engine_update": "20240121",
            "category": "undetected",
            "result": null
          },
          "Skyhigh": {
            "method": "blacklist",
            "engine_name": "Skyhigh",
            "engine_version": "v2021.2.0+4045",
            "engine_update": "20240121",
            "category": "undetected",
            "result": null
          },
          "McAfee": {
            "method": "blacklist",
            "engine_name": "McAfee",
            "engine_version": "6.0.6.653",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Malwarebytes": {
            "method": "blacklist",
            "engine_name": "Malwarebytes",
            "engine_version": "4.5.5.54",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Zillya": {
            "method": "blacklist",
            "engine_name": "Zillya",
            "engine_version": "2.0.0.5037",
            "engine_update": "20240119",
            "category": "undetected",
            "result": null
          },
          "Sangfor": {
            "method": "blacklist",
            "engine_name": "Sangfor",
            "engine_version": "2.23.0.0",
            "engine_update": "20240119",
            "category": "undetected",
            "result": null
          },
          "K7AntiVirus": {
            "method": "blacklist",
            "engine_name": "K7AntiVirus",
            "engine_version": "12.137.50814",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "K7GW": {
            "method": "blacklist",
            "engine_name": "K7GW",
            "engine_version": "12.137.50812",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Baidu": {
            "method": "blacklist",
            "engine_name": "Baidu",
            "engine_version": "1.0.0.2",
            "engine_update": "20190318",
            "category": "undetected",
            "result": null
          },
          "VirIT": {
            "method": "blacklist",
            "engine_name": "VirIT",
            "engine_version": "9.5.622",
            "engine_update": "20240119",
            "category": "undetected",
            "result": null
          },
          "Symantec": {
            "method": "blacklist",
            "engine_name": "Symantec",
            "engine_version": "1.21.0.0",
            "engine_update": "20240121",
            "category": "undetected",
            "result": null
          },
          "ESET-NOD32": {
            "method": "blacklist",
            "engine_name": "ESET-NOD32",
            "engine_version": "28609",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "TrendMicro-HouseCall": {
            "method": "blacklist",
            "engine_name": "TrendMicro-HouseCall",
            "engine_version": "10.0.0.1040",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Avast": {
            "method": "blacklist",
            "engine_name": "Avast",
            "engine_version": "23.9.8494.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Cynet": {
            "method": "blacklist",
            "engine_name": "Cynet",
            "engine_version": "4.0.0.28",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Kaspersky": {
            "method": "blacklist",
            "engine_name": "Kaspersky",
            "engine_version": "22.0.1.28",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "BitDefender": {
            "method": "blacklist",
            "engine_name": "BitDefender",
            "engine_version": "7.2",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "NANO-Antivirus": {
            "method": "blacklist",
            "engine_name": "NANO-Antivirus",
            "engine_version": "1.0.146.25796",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "SUPERAntiSpyware": {
            "method": "blacklist",
            "engine_name": "SUPERAntiSpyware",
            "engine_version": "5.6.0.1032",
            "engine_update": "20240121",
            "category": "undetected",
            "result": null
          },
          "Tencent": {
            "method": "blacklist",
            "engine_name": "Tencent",
            "engine_version": "1.0.0.1",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Sophos": {
            "method": "blacklist",
            "engine_name": "Sophos",
            "engine_version": "2.4.3.0",
            "engine_update": "20240121",
            "category": "undetected",
            "result": null
          },
          "F-Secure": {
            "method": "blacklist",
            "engine_name": "F-Secure",
            "engine_version": "18.10.1547.307",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "DrWeb": {
            "method": "blacklist",
            "engine_name": "DrWeb",
            "engine_version": "7.0.61.8090",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "VIPRE": {
            "method": "blacklist",
            "engine_name": "VIPRE",
            "engine_version": "6.0.0.35",
            "engine_update": "20240121",
            "category": "undetected",
            "result": null
          },
          "TrendMicro": {
            "method": "blacklist",
            "engine_name": "TrendMicro",
            "engine_version": "11.0.0.1006",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Emsisoft": {
            "method": "blacklist",
            "engine_name": "Emsisoft",
            "engine_version": "2022.6.0.32461",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "GData": {
            "method": "blacklist",
            "engine_name": "GData",
            "engine_version": "A:25.37212B:27.34653",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Jiangmin": {
            "method": "blacklist",
            "engine_name": "Jiangmin",
            "engine_version": "16.0.100",
            "engine_update": "20240121",
            "category": "undetected",
            "result": null
          },
          "Google": {
            "method": "blacklist",
            "engine_name": "Google",
            "engine_version": "1705915833",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Avira": {
            "method": "blacklist",
            "engine_name": "Avira",
            "engine_version": "8.3.3.16",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Antiy-AVL": {
            "method": "blacklist",
            "engine_name": "Antiy-AVL",
            "engine_version": "3.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Kingsoft": {
            "method": "blacklist",
            "engine_name": "Kingsoft",
            "engine_version": "None",
            "engine_update": "20230906",
            "category": "undetected",
            "result": null
          },
          "Gridinsoft": {
            "method": "blacklist",
            "engine_name": "Gridinsoft",
            "engine_version": "1.0.155.174",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Xcitium": {
            "method": "blacklist",
            "engine_name": "Xcitium",
            "engine_version": "36368",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Arcabit": {
            "method": "blacklist",
            "engine_name": "Arcabit",
            "engine_version": "2022.0.0.18",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "ViRobot": {
            "method": "blacklist",
            "engine_name": "ViRobot",
            "engine_version": "2014.3.20.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "ZoneAlarm": {
            "method": "blacklist",
            "engine_name": "ZoneAlarm",
            "engine_version": "1.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Microsoft": {
            "method": "blacklist",
            "engine_name": "Microsoft",
            "engine_version": "1.1.23110.2",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Varist": {
            "method": "blacklist",
            "engine_name": "Varist",
            "engine_version": "6.5.1.2",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "AhnLab-V3": {
            "method": "blacklist",
            "engine_name": "AhnLab-V3",
            "engine_version": "3.25.0.10459",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Acronis": {
            "method": "blacklist",
            "engine_name": "Acronis",
            "engine_version": "1.2.0.121",
            "engine_update": "20230828",
            "category": "undetected",
            "result": null
          },
          "BitDefenderTheta": {
            "method": "blacklist",
            "engine_name": "BitDefenderTheta",
            "engine_version": "7.2.37796.0",
            "engine_update": "20240103",
            "category": "undetected",
            "result": null
          },
          "ALYac": {
            "method": "blacklist",
            "engine_name": "ALYac",
            "engine_version": "2.0.0.8",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "TACHYON": {
            "method": "blacklist",
            "engine_name": "TACHYON",
            "engine_version": "2024-01-22.02",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "VBA32": {
            "method": "blacklist",
            "engine_name": "VBA32",
            "engine_version": "5.0.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Zoner": {
            "method": "blacklist",
            "engine_name": "Zoner",
            "engine_version": "2.2.2.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Rising": {
            "method": "blacklist",
            "engine_name": "Rising",
            "engine_version": "25.0.0.27",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Yandex": {
            "method": "blacklist",
            "engine_name": "Yandex",
            "engine_version": "5.5.2.24",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Ikarus": {
            "method": "blacklist",
            "engine_name": "Ikarus",
            "engine_version": "6.2.4.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "MaxSecure": {
            "method": "blacklist",
            "engine_name": "MaxSecure",
            "engine_version": "1.0.0.1",
            "engine_update": "20240120",
            "category": "undetected",
            "result": null
          },
          "Fortinet": {
            "method": "blacklist",
            "engine_name": "Fortinet",
            "engine_version": "None",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "AVG": {
            "method": "blacklist",
            "engine_name": "AVG",
            "engine_version": "23.9.8494.0",
            "engine_update": "20240122",
            "category": "undetected",
            "result": null
          },
          "Panda": {
            "method": "blacklist",
            "engine_name": "Panda",
            "engine_version": "4.6.4.2",
            "engine_update": "20240121",
            "category": "undetected",
            "result": null
          },
          "Avast-Mobile": {
            "method": "blacklist",
            "engine_name": "Avast-Mobile",
            "engine_version": "240122-02",
            "engine_update": "20240122",
            "category": "type-unsupported",
            "result": null
          },
          "SymantecMobileInsight": {
            "method": "blacklist",
            "engine_name": "SymantecMobileInsight",
            "engine_version": "2.0",
            "engine_update": "20240103",
            "category": "type-unsupported",
            "result": null
          },
          "BitDefenderFalx": {
            "method": "blacklist",
            "engine_name": "BitDefenderFalx",
            "engine_version": "2.0.936",
            "engine_update": "20240108",
            "category": "type-unsupported",
            "result": null
          },
          "Elastic": {
            "method": "blacklist",
            "engine_name": "Elastic",
            "engine_version": "4.0.125",
            "engine_update": "20240115",
            "category": "type-unsupported",
            "result": null
          },
          "tehtris": {
            "method": "blacklist",
            "engine_name": "tehtris",
            "engine_version": "v0.1.4-109-g76614fd",
            "engine_update": "20240122",
            "category": "type-unsupported",
            "result": null
          },
          "APEX": {
            "method": "blacklist",
            "engine_name": "APEX",
            "engine_version": "6.492",
            "engine_update": "20240122",
            "category": "type-unsupported",
            "result": null
          },
          "Paloalto": {
            "method": "blacklist",
            "engine_name": "Paloalto",
            "engine_version": "0.9.0.1003",
            "engine_update": "20240122",
            "category": "type-unsupported",
            "result": null
          },
          "Alibaba": {
            "method": "blacklist",
            "engine_name": "Alibaba",
            "engine_version": "0.3.0.5",
            "engine_update": "20190527",
            "category": "type-unsupported",
            "result": null
          },
          "Webroot": {
            "method": "blacklist",
            "engine_name": "Webroot",
            "engine_version": "1.0.0.403",
            "engine_update": "20240122",
            "category": "type-unsupported",
            "result": null
          },
          "Cylance": {
            "method": "blacklist",
            "engine_name": "Cylance",
            "engine_version": "2.0.0.0",
            "engine_update": "20240103",
            "category": "type-unsupported",
            "result": null
          },
          "SentinelOne": {
            "method": "blacklist",
            "engine_name": "SentinelOne",
            "engine_version": "23.4.2.3",
            "engine_update": "20231119",
            "category": "type-unsupported",
            "result": null
          },
          "Trustlook": {
            "method": "blacklist",
            "engine_name": "Trustlook",
            "engine_version": "1.0",
